#coding=utf-8
import urllib2
import re
import json
import time,datetime
import random
from mysql import Mysql



class AuctionCrawler:
    #2017-10-31到2017-11-2数据暂无
    #time_from = time.strftime('%Y-%m-%d', time.localtime(time.time() - 86400))
    #time_to = time.strftime('%Y-%m-%d', time.localtime(time.time()))
    time_from = '2016-1-1'
    time_to = '2017-11-10'
    circleList = ['1','2','3','4','5']
    circle = '1'
    BEIJINGCOURT = {
        '北京市第一中级人民法院': '2234908182',
        '北京市第二中级人民法院': '2040098540',
        '北京市第三中级人民法院': '2232785239',
        '北京市第四中级人民法院': '2046195679',
        '北京市丰台区人民法院': '2046195679',
        '北京市西城区人民法院': '2235258307',
        '北京市昌平区人民法院': '2231208898',
        '北京市通州区人民法院': '2240421956',
        '北京市东城区人民法院)': '2231298949',
        '北京市房山区人民法院': '2234928298',
        '北京市大兴区人民法院': '2240421944',
        '密云县人民法院': '2235128287',
        '北京市门头沟区人民法院': '2231139653',
        '北京市怀柔区人民法院': '2240411921',
        '北京市石景山区人民法院': '2240282320',
        '北京市延庆区人民法院': '2231388576',
        '北京市朝阳区人民法院': '2232785245',
        '北京市平谷区人民法院': '2232715272',
        '北京市海淀区人民法院': '2260867569',
        '北京市顺义区人民法院': '2240322043'
    }
    TIANJINCOURT = {
        '天津市第二中级人民法院': '2115335772',
        '天津市第一中级人民法院': '2560305826',
        '天津市津南区人民法院': '2633947176',
        '天津市南开区人民法院': '2607222401',
        '天津市滨海新区人民法院': '2636516939',
        '天津市河西区人民法院': '2639842858',
        '天津市东丽区人民法院': '2636616629',
        '天津市静海区人民法院': '2640012386',
        '天津市河东区人民法院': '2627645177',
        '天津市北辰区人民法院': '2636702439',
        '天津市河北区人民法院': '2605391211',
        '天津市武清区人民法院': '2640032284',
        '天津市西青区人民法院': '2639723418',
        '天津市和平区人民法院': '2636665708',
        '天津市宝坻区人民法院': '2639862723',
        '天津市红桥区人民法院': '2639733326',
        '天津市宁河区人民法院': '2636635829',
        '天津市蓟州区人民法院': '2691634388',
        '天津海事法院': '2584892421',
        '天津铁路运输法院': '2639842872'

    }
    CHONGQINGCOURT = {
        '重庆市第五中级人民法院': '3258040319',
        '重庆市第二中级人民法院': '3175609193',
        '重庆市第一中级人民法院': '3322058076',
        '重庆市第三中级人民法院': '3174882763',
        '重庆市第四中级人民法院': '3234937670',
        '重庆市渝北区人民法院': '3159989164',
        '重庆市渝中区人民法院': '3172569645',
        '重庆市江北区人民法院': '3165198805',
        '重庆市九龙坡区人民法院': '3160765996',
        '重庆市沙坪坝区人民法院': '3160696789',
        '重庆市合川区人民法院': '3192032490',
        '重庆市永川区人民法院': '3202097459',
        '重庆市江津区人民法院': '3217312040',
        '重庆市南川区人民法院': '3193565991',
        '重庆市万州区人民法院': '3175708950',
        '重庆市大渡口区人民法院': '3192122221',
        '重庆市北碚区人民法院': '3175137113',
        '重庆市荣昌区人民法院': '3191641025',
        '重庆市大足区人民法院': '3182081960',
        '重庆市涪陵区人民法院': '3175173893',
        '重庆市南岸区人民法院': '3160045936',
        '重庆市黔江区人民法院': '3229808010',
        '重庆市长寿区人民法院': '3190920575',
        '重庆市梁平区人民法院': '3199842096',
        '重庆市璧山区人民法院': '3246572159',
        '重庆市巴南区人民法院': '3171009319',
        '重庆市开州区人民法院': '3201745049',
        '重庆市綦江区人民法院': '3253528343',
        '重庆市铜梁区人民法院': '3234807658',
        '云阳县人民法院': '3201738464',
        '垫江县人民法院': '3182213856',
        '奉节县人民法院': '3201658996',
        '丰都县人民法院': '3191121779',
        '酉阳土家族苗族自治县人民法院': '3299630199',
        '忠县人民法院': '3201579418',
        '重庆市潼南区人民法院': '3190436598',
        '彭水苗族土家族自治县人民法院': '3307243355',
        '城口县人民法院': '3202274665',
        '巫山县人民法院': '3204380839',
        '秀山土家族苗族自治县人民法院': '3367839536',
        '巫溪县人民法院': '3201911113',
        '重庆铁路运输法院': '3382595917',
        '重庆市武隆区人民法院': '3218393722'
    }
    SHANGHAICOURT = {
        '上海市第二中级人民法院': '3034780857',
        '上海市第一中级人民法院': '3162629397',
        '上海市闵行区人民法院': '3023061510',
        '上海海事法院': '2659348522',
        '上海市嘉定区人民法院': '3029276111',
        '上海市杨浦区人民法院': '3048794865',
        '上海市宝山区人民法院': '3166407744',
        '上海市普陀区人民法院': '3162329714'
    }
    SHANDONGCOURT = {
        '山东省滨州市中级人民法院': '2011309567',
        '滨州市滨城区人民法院': '2659977148',
        '邹平县人民法院': '2659997107',
        '博兴县人民法院': '2660076429',
        '惠民县人民法院': '2659987265',
        '阳信县人民法院': '2659937314',
        '滨州市沾化区人民法院': '2660204702',
        '无棣县人民法院': '2660254711',
        '滨州经济技术开发区人民法院': '2849727503',
        '德州市中级人民法院': '3204510211',
        '临邑县人民法院': '2255166039',
        '夏津县人民法院': '2843366738',
        '德州经济技术开发区人民法院': '3215102614',
        '德州市德城区人民法院': '3216423443',
        '武城县人民法院': '3192167315',
        '庆云县人民法院': '2378442945',
        '德州市陵城区人民法院': '3217036994',
        '乐陵市人民法院': '3208189647',
        '齐河县人民法院': '3216427876',
        '禹城市人民法院': '3216378095',
        '宁津县人民法院': '3214644150',
        '平原县人民法院': '3216526841',
        '东营市中级人民法院': '3218630783',
        '广饶县人民法院': '3217229908',
        '东营市河口区人民法院': '3228605984',
        '东营市东营区人民法院': '3229886197',
        '东营经济技术开发区人民法院': '3280397282',
        '利津县人民法院': '3217037046',
        '东营市垦利区人民法院': '3294132384',
        '菏泽市中级人民法院': '3208154025',
        '单县人民法院': '3208199486',
        '鄄城县人民法院': '3216467041',
        '巨野县人民法院': '3243860333',
        '郓城县人民法院': '3221145961',
        '菏泽市牡丹区人民法院': '3333326969',
        '菏泽市定陶区人民法院': '3229080338',
        '成武县人民法院': '3332293605',
        '曹县人民法院': '3208154028',
        '东明县人民法院': '3217196008',
        '菏泽经济开发区人民法院': '3229961236',
        '山东省济南市中级人民法院': '3204460314',
        '济南铁路运输中级法院': '3218481558',
        '山东省高级人民法院': '3326621549',
        '济南市市中区人民法院': '3231819656',
        '平阴县人民法院': '3216502921',
        '济南市槐荫区人民法院': '3192162490',
        '济南市历下区人民法院': '3230049440',
        '济南市历城区人民法院': '3193556215',
        '济阳县人民法院': '3208183770',
        '济南市天桥区人民法院': '3232018663',
        '济南市章丘区人民法院': '3343012069',
        '商河县人民法院': '3215222205',
        '济南市长清区人民法院': '3201722089',
        '济南高新技术产业开发区人民法院': '3208748384',
        '济南铁路运输法院': '3221185709',
        '山东省济宁市中级人民法院': '3216328271',
        '邹城市人民法院': '3216997659',
        '济宁市任城区人民法院': '3328980961',
        '嘉祥县人民法院': '3230762720',
        '汶上县人民法院': '3214713984',
        '济宁市兖州区人民法院': '3243001864',
        '微山县人民法院': '3217219848',
        '鱼台县人民法院': '3217450792',
        '梁山县人民法院': '3329432597',
        '曲阜市人民法院': '3218205305',
        '金乡县人民法院': '3218066514',
        '济宁高新技术产业开发区人民法院': '3247816717',
        '泗水县人民法院': '3221457998',
        '山东省临沂市中级人民法院': '3328672101',
        '临沂市兰山区人民法院': '2743040503',
        '临沂市罗庄区人民法院': '3332398279',
        '临沭县人民法院': '2509016127',
        '临沂市河东区人民法院': '3217007249',
        '莒南县人民法院': '3230030434',
        '沂南县人民法院': '3109006822',
        '平邑县人民法院': '3204259906',
        '郯城县人民法院': '3329294306',
        '蒙阴县人民法院': '3333250817',
        '兰陵县人民法院': '3329313064',
        '费县人民法院': '3332179843',
        '沂水县人民法院': '3332194455',
        '临沂经济技术开发区人民法院': '3360428115',
        '临沂高新技术产业开发区人民法院': '3356012854',
        '聊城市中级人民法院': '3192028033',
        '阳谷县人民法院': '2932748594',
        '聊城市东昌府区人民法院': '3208807365',
        '莘县人民法院': '3214823962',
        '高唐县人民法院': '3216415895',
        '东阿县人民法院': '3214714122',
        '临清市人民法院': '3329246952',
        '茌平县人民法院': '3232362258',
        '冠县人民法院': '3261752359',
        '山东省莱芜市中级人民法院': '3203719375',
        '莱芜市莱城区人民法院': '3205786457',
        '莱芜市钢城区人民法院': '3204480262',
        '山东省青岛市中级人民法院': '3229955761',
        '青岛市市北区人民法院': '3333483825',
        '胶州市人民法院': '3214984203',
        '即墨市人民法院': '3247324889',
        '青岛市黄岛区人民法院': '3220953648',
        '青岛市市南区人民法院': '3254521199',
        '青岛市崂山区人民法院': '3334859814',
        '青岛市李沧区人民法院': '3245628498',
        '青岛市城阳区人民法院': '3221048287',
        '平度市人民法院': '3307124109',
        '莱西市人民法院': '3335283298',
        '青岛铁路运输法院': '3216377545',
        '山东省日照市中级人民法院': '3193095053',
        '日照市东港区人民法院': '2189132792',
        '莒县人民法院': '3191796112',
        '日照经济技术开发区人民法院': '3190684845',
        '日照市岚山区人民法院': '3193365499',
        '五莲县人民法院': '2575577688',
        '泰安市中级人民法院': '3221185187',
        '泰安市泰山区人民法院': '3216433313',
        '泰安市岱岳区人民法院': '3208857344',
        '新泰市人民法院': '3191171467',
        '肥城市人民法院': '3217046549',
        '宁阳县人民法院': '3193478965',
        '东平县人民法院': '3215182437',
        '山东省潍坊市中级人民法院': '3192698889',
        '潍坊市奎文区人民法院': '3228219761',
        '临朐县人民法院': '3192217172',
        '寿光市人民法院': '3232062246',
        '昌乐县人民法院': '3217312125',
        '潍坊高新技术产业开发区人民法院': '3339000545',
        '潍坊市潍城区人民法院': '3216326816',
        '高密市人民法院': '3214724573',
        '潍坊市寒亭区人民法院': '3216434830',
        '昌邑市人民法院': '3221205535',
        '诸城市人民法院': '3243768697',
        '潍坊市坊子区人民法院': '3193625816',
        '青州市人民法院': '3216267304',
        '安丘市人民法院': '3216405191',
        '潍坊滨海经济技术开发区人民法院': '3190920574',
        '山东省威海市中级人民法院': '3218314881',
        '威海市环翠区人民法院': '3204490246',
        '威海经济技术开发区人民法院': '3201572554',
        '威海市文登区人民法院': '3234808128',
        '荣成市人民法院': '3243539900',
        '威海火炬高技术产业开发区人民法院': '3252510039',
        '乳山市人民法院': '3236732174',
        '山东省烟台市中级人民法院': '3230369910',
        '莱州市人民法院': '2360710587',
        '烟台市牟平区人民法院': '2578734553',
        '烟台市福山区人民法院': '2824352314',
        '海阳市人民法院': '2729493701',
        '栖霞市人民法院': '2335914508',
        '莱阳市人民法院': '2360515870',
        '烟台经济技术开发区人民法院': '3175549478',
        '烟台市芝罘区人民法院': '2370594529',
        '招远市人民法院': '2636941355',
        '烟台市莱山区人民法院': '3216413565',
        '龙口市人民法院': '3193705841',
        '蓬莱市人民法院': '3207935541',
        '烟台高新技术产业开发区人民法院': '3221051611',
        '长岛县人民法院': '3218720092',
        '山东省淄博市中级人民法院': '3199632992',
        '淄博市张店区人民法院': '3165403877',
        '淄博市临淄区人民法院': '3215132771',
        '淄博市淄川区人民法院': '3202520185',
        '淄博市周村区人民法院': '3208778297',
        '淄博市博山区人民法院': '3206015162',
        '桓台县人民法院': '3204209832',
        '高青县人民法院': '3208748390',
        '沂源县人民法院': '3204440492',
        '淄博高新技术产业开发区人民法院': '3214586693',
        '山东省枣庄市中级人民法院': '3204299775',
        '枣庄市市中区人民法院': '3214994127',
        '枣庄市台儿庄区人民法院': '3208232927',
        '枣庄市山亭区人民法院': '3208139749',
        '枣庄市薛城区人民法院': '3191840253',
        '枣庄市峄城区人民法院': '3191834371',
        '滕州市人民法院': '3208183681'
    }
    FUJIANCOURT = {
        '福建省福州市中级人民法院': '2066093121',
        '福州市鼓楼区人民法院': '2067454776',
        '福州市台江区人民法院': '2066024314',
        '平潭县人民法院': '2066004961',
        '福州市仓山区人民法院': '2066043883',
        '福州市晋安区人民法院': '2068766196',
        '福清市人民法院': '2068618469',
        '福州市马尾区人民法院': '2068756208',
        '罗源县人民法院': '2059284526',
        '闽侯县人民法院': '2068697444',
        '长乐市人民法院': '2066034044',
        '闽清县人民法院': '2063903196',
        '永泰县人民法院': '2068746407',
        '连江县人民法院': '2066014473',
        '福建省龙岩市中级人民法院': '2060107467',
        '龙岩市新罗区人民法院': '2072594555',
        '长汀县人民法院': '2067532901',
        '漳平市人民法院': '2072594540',
        '龙岩市永定区人民法院': '2066014470',
        '武平县人民法院': '2067552687',
        '上杭县人民法院': '2068677589',
        '连城县人民法院': '2059304126',
        '福建省南平市中级人民法院': '2063785221',
        '南平市建阳区人民法院': '2063755527',
        '邵武市人民法院': '2066142182',
        '浦城县人民法院': '2066083753',
        '建瓯市人民法院': '2066083760',
        '武夷山市人民法院': '2066093138',
        '南平市延平区人民法院': '2076187982',
        '顺昌县人民法院': '2068766198',
        '松溪县人民法院': '2066132251',
        '光泽县人民法院': '2072506266',
        '政和县人民法院': '2074639194',
        '福建省宁德市中级人民法院': '2059244732',
        '福安市人民法院': '2066004966',
        '宁德市蕉城区人民法院': '2066043895',
        '福鼎市人民法院': '2067474183',
        '柘荣县人民法院': '2066102743',
        '霞浦县人民法院': '2068746408',
        '寿宁县人民法院': '2082026992',
        '周宁县人民法院': '2066132250',
        '屏南县人民法院': '2066151913',
        '古田县人民法院': '2082056548',
        '福建省莆田市中级人民法院': '2060077537',
        '莆田市涵江区人民法院': '2066004967',
        '莆田市城厢区人民法院': '2067503326',
        '仙游县人民法院': '2066014457',
        '莆田市荔城区人民法院': '2103114356',
        '莆田市秀屿区人民法院': '2066122343',
        '福建省泉州市中级人民法院': '2082664929',
        '石狮市人民法院': '2066151905',
        '泉州市丰泽区人民法院': '2096696551',
        '晋江市人民法院': '2082704382',
        '南安市人民法院': '2066093129',
        '安溪县人民法院': '2089986282',
        '德化县人民法院': '2091010517',
        '惠安县人民法院': '2082813075',
        '泉州市鲤城区人民法院': '2066024316',
        '永春县人民法院': '2066151906',
        '泉州市洛江区人民法院': '2091526874',
        '泉州市泉港区人民法院': '2087199404',
        '福建省三明市中级人民法院': '2066122346',
        '永安市人民法院': '2059313844',
        '沙县人民法院': '2066073651',
        '三明市梅列区人民法院': '2066083918',
        '清流县人民法院': '2066112507',
        '三明市三元区人民法院': '2066132243',
        '尤溪县人民法院': '2066034043',
        '将乐县人民法院': '2066112506',
        '泰宁县人民法院': '2066161693',
        '明溪县人民法院': '2066093149',
        '宁化县人民法院': '2066014467',
        '建宁县人民法院': '2074697566',
        '大田县人民法院': '2066093147',
        '福建省厦门市中级人民法院': '2072613989',
        '厦门市思明区人民法院': '2080407821',
        '厦门市同安区人民法院': '2066053817',
        '厦门市湖里区人民法院': '2075898592',
        '厦门市集美区人民法院': '2067415867',
        '厦门市翔安区人民法院': '2076057984',
        '厦门市海沧区人民法院': '2075938616',
        '福建省漳州市中级人民法院': '2059294177',
        '漳州市芗城区人民法院': '2075977964',
        '长泰县人民法院': '2066043892',
        '龙海市人民法院': '2075958091',
        '南靖县人民法院': '2066024329',
        '漳州市龙文区人民法院': '2063883508',
        '云霄县人民法院': '2066073647',
        '华安县人民法院': '2066024313',
        '平和县人民法院': '2067474198',
        '东山县人民法院': '2080407832',
        '诏安县人民法院': '2067484028',
        '漳浦县人民法院': '2072565293'
    }
    ANHUICOURT = {
        '安徽省安庆市中级人民法院': '3377883164',
        '安庆市大观区人民法院': '3328473267',
        '潜山县人民法院': '3401246104',
        '太湖县人民法院': '3364598383',
        '安庆市迎江区人民法院': '3400614103',
        '岳西县人民法院': '3400335522',
        '望江县人民法院': '3377630886',
        '宿松县人民法院': '3300332472',
        '桐城市人民法院': '3391748657',
        '蚌埠市中级人民法院': '3241967764',
        '固镇县人民法院': '3236808204',
        '五河县人民法院': '3261127301',
        '蚌埠市蚌山区人民法院': '3159742343',
        '蚌埠市禹会区人民法院': '3236897213',
        '蚌埠市龙子湖区人民法院': '3236718379',
        '蚌埠市淮上区人民法院': '3242956134',
        '安徽省亳州市中级人民法院': '3295875442',
        '利辛县人民法院': '3356992116',
        '亳州市谯城区人民法院': '3399762824',
        '安徽省滁州市中级人民法院': '2338951344',
        '滁州市琅琊区人民法院': '2861895357',
        '全椒县人民法院': '2861955282',
        '天长市人民法院': '2863317519',
        '滁州市南谯区人民法院': '2861915396',
        '明光市人民法院': '2861945399',
        '凤阳县人民法院': '2861875536',
        '定远县人民法院': '2863218054',
        '来安县人民法院': '2861745603',
        '安徽省池州市中级人民法院': '3357382192',
        '池州市贵池区人民法院': '3369428844',
        '青阳县人民法院': '3361644471',
        '九华山风景区人民法院': '3357441793',
        '东至县人民法院': '3360349811',
        '石台县人民法院': '3364436839',
        '安徽省阜阳市中级人民法院': '3251287385',
        '阜阳市颍泉区人民法院': '3321701321',
        '阜阳市颍州区人民法院': '3294999374',
        '太和县人民法院': '3328831629',
        '阜阳市颍东区人民法院': '3339080597',
        '阜南县人民法院': '3311055881',
        '界首市人民法院': '3400574595',
        '临泉县人民法院': '3306947612',
        '安徽省黄山市中级人民法院': '2040029682',
        '黄山市屯溪区人民法院': '2314086152',
        '黄山市黄山区人民法院': '2247636902',
        '休宁县人民法院': '2324607660',
        '歙县人民法院': '2226874068',
        '祁门县人民法院': '2231938710',
        '黟县人民法院': '2281766523',
        '黄山市徽州区人民法院': '2281726494',
        '安徽省淮北市中级人民法院': '3309266237',
        '淮北市相山区人民法院': '3261647678',
        '濉溪县人民法院': '2863069432',
        '淮北市杜集区人民法院': '3334869721',
        '淮北市烈山区人民法院': '3333480823',
        '安徽省淮南市中级人民法院': '3363513506',
        '淮南市田家庵区人民法院': '3247458640',
        '安徽省合肥市中级人民法院': '3347967603',
        '合肥市庐阳区人民法院': '3415791429',
        '合肥市包河区人民法院': '3402424209',
        '合肥市瑶海区人民法院': '3409481901',
        '合肥市蜀山区人民法院': '3368244291',
        '合肥高新技术产业开发区人民法院': '3413272333',
        '长丰县人民法院': '3405884235',
        '巢湖市人民法院': '3407977477',
        '安徽省六安市中级人民法院': '3201928545',
        '六安市裕安区人民法院': '3228635974',
        '六安市金安区人民法院': '3257477386',
        '舒城县人民法院': '3325545728',
        '霍山县人民法院': '3301878046',
        '霍邱县人民法院': '3310460021',
        '六安市叶集区人民法院': '3301615911',
        '金寨县人民法院': '3363331002',
        '安徽省马鞍山市中级人民法院': '1934466967',
        '含山县人民法院': '2861059840',
        '马鞍山市花山区人民法院': '3332243892',
        '当涂县人民法院': '3362507322',
        '马鞍山市雨山区人民法院': '3338906596',
        '和县人民法院': '3329174187',
        '马鞍山市博望区人民法院': '3360399196',
        '安徽省宿州市中级人民法院': '3214934891',
        '砀山县人民法院': '3252199883',
        '萧县人民法院': '3248156016',
        '泗县人民法院': '3247225466',
        '灵璧县人民法院': '3216536957',
        '宿州市埇桥区人民法院': '3228967050',
        '安徽省铜陵市中级人民法院': '3334232275',
        '铜陵市铜官区人民法院': '3342032513',
        '枞阳县人民法院': '3342961814',
        '铜陵市义安区人民法院': '3338489604',
        '铜陵市郊区人民法院': '3349281808',
        '安徽省芜湖市中级人民法院': '2364124517',
        '芜湖市镜湖区人民法院': '2347754587',
        '无为县人民法院': '2363995066',
        '南陵县人民法院': '2861566018',
        '芜湖市弋江区人民法院': '2136282556',
        '芜湖县人民法院': '3357648612',
        '芜湖市三山区人民法院': '2484764436',
        '芜湖市鸠江区人民法院': '2540830194',
        '芜湖经济技术开发区人民法院': '2613124110',
        '繁昌县人民法院': '2594056972',
        '安徽省宣城市中级人民法院': '3218284533',
        '宣城市宣州区人民法院': '3247384672',
        '广德县人民法院': '3228419302',
        '宁国市人民法院': '2587520544',
        '郎溪县人民法院': '3228966960',
        '泾县人民法院': '3340772942',
        '绩溪县人民法院': '2215953020',
        '旌德县人民法院': '3261265840'
    }
    NEIMENGGUCOURT = {
        '内蒙古自治区阿拉善盟中级人民法院': '2360720506',
        '额济纳旗人民法院': '2630439269',
        '阿拉善左旗人民法院': '2633836454',
        '内蒙古自治区巴彦淖尔市中级人民法院': '2089986319',
        '巴彦淖尔市临河区人民法院': '3172992172',
        '乌拉特前旗人民法院': '3182084313',
        '杭锦后旗人民法院': '3175546350',
        '五原县人民法院': '3171979231',
        '乌拉特后旗人民法院': '3175056436',
        '磴口县人民法院': '3350769112',
        '乌拉特中旗人民法院': '3189562307',
        '内蒙古自治区包头市中级人民法院': '2090084971',
        '包头市昆都仑区人民法院': '2090997560',
        '包头市东河区人民法院': '2091506914',
        '内蒙古自治区固阳县人民法院': '2095608974',
        '土默特右旗人民法院': '2091046645',
        '包头市九原区人民法院': '2091526813',
        '包头稀土高新技术产业开发区人民法院': '2091105699',
        '包头市青山区人民法院': '2091526794',
        '达尔罕茂明安联合旗人民法院': '2095608954',
        '包头铁路运输法院': '2636740314',
        '包头市石拐区人民法院': '2091477522',
        '包头市白云鄂博矿区人民法院': '2091399161',
        '内蒙古自治区赤峰市中级人民法院': '2384958084',
        '赤峰市红山区人民法院': '3043177950',
        '宁城县人民法院': '3171555055',
        '克什克腾旗人民法院': '3086418607',
        '赤峰市松山区人民法院': '3070586668',
        '巴林左旗人民法院': '3081697817',
        '林西县人民法院': '3048491290',
        '巴林右旗人民法院': '3070566755',
        '喀喇沁旗人民法院': '3073979895',
        '阿鲁科尔沁旗人民法院': '3077592569',
        '赤峰市元宝山区人民法院': '3119810022',
        '翁牛特旗人民法院': '3169907362',
        '敖汉旗人民法院': '3322157623',
        '内蒙古自治区鄂尔多斯市中级人民法院': '2363843957',
        '鄂尔多斯市东胜区人民法院': '2472907730',
        '伊金霍洛旗人民法院': '2430598453',
        '准格尔旗人民法院': '2436345103',
        '达拉特旗人民法院': '2215913438',
        '鄂托克旗人民法院': '2476190776',
        '杭锦旗人民法院': '2430498573',
        '乌审旗人民法院': '2436325193',
        '鄂托克前旗人民法院': '2472788823',
        '内蒙古自治区呼和浩特市中级人民法院': '2636459965',
        '呼和浩特铁路运输中级法院': '2636070383',
        '土默特左旗人民法院': '2633986102',
        '呼和浩特市玉泉区人民法院': '2636489909',
        '呼和浩特市回民区人民法院': '2687805251',
        '托克托县人民法院': '2630570314',
        '呼和浩特市赛罕区人民法院': '2644638790',
        '呼和浩特市新城区人民法院': '2530231951',
        '清水河县人民法院': '2630650161',
        '呼和浩特铁路运输法院': '2633746635',
        '武川县人民法院': '3180121947',
        '和林格尔县人民法院': '2644588894',
        '内蒙古自治区呼伦贝尔市中级人民法院': '2633966120',
        '牙克石市人民法院': '2639992370',
        '阿荣旗人民法院': '2639904089',
        '扎兰屯市人民法院': '2634689621',
        '呼伦贝尔市海拉尔区人民法院': '2633796721',
        '陈巴尔虎旗人民法院': '2630449436',
        '满洲里市人民法院': '2633716881',
        '鄂伦春自治旗人民法院': '2640357997',
        '新巴尔虎右旗人民法院': '2636609484',
        '鄂温克族自治旗人民法院': '2631061788',
        '莫力达瓦达斡尔族自治旗人民法院': '2634589993',
        '根河市人民法院': '2634659762',
        '新巴尔虎左旗人民法院': '3173002397',
        '内蒙古自治区通辽市中级人民法院': '2658888943',
        '通辽市科尔沁区人民法院': '2631241469',
        '奈曼旗人民法院': '2630439262',
        '科尔沁左翼中旗人民法院': '2633946218',
        '开鲁县人民法院': '2639733277',
        '霍林郭勒市人民法院': '3346280332',
        '内蒙古自治区乌海市中级人民法院': '2634589936',
        '乌海市海勃湾区人民法院': '3177784119',
        '乌海市海南区人民法院': '2584769884',
        '乌海市乌达区人民法院': '3172094074',
        '内蒙古自治区乌兰察布市中级人民法院': '2630640237',
        '乌兰察布市集宁区人民法院': '2631061738',
        '察哈尔右翼后旗人民法院': '2640091817',
        '化德县人民法院': '2633707296',
        '察哈尔右翼前旗人民法院': '2633995963',
        '卓资县人民法院': '2631331432',
        '四子王旗人民法院': '2633796724',
        '凉城县人民法院': '2633926228',
        '丰镇市人民法院': '2634919033',
        '察哈尔右翼中旗人民法院': '2634075768',
        '商都县人民法院': '2635000042',
        '兴和县人民法院': '2633826403',
        '内蒙古自治区锡林郭勒盟中级人民法院': '2636730526',
        '锡林浩特市人民法院': '2605286665',
        '二连浩特市人民法院': '2634819490',
        '正镶白旗人民法院': '3199549624',
        '东乌珠穆沁旗人民法院': '3191704966',
        '阿巴嘎旗人民法院': '3188981574',
        '太仆寺旗人民法院': '3261087188',
        '多伦县人民法院': '3191303525',
        '苏尼特左旗人民法院': '3339962277',
        '西乌珠穆沁旗人民法院': '3199652797',
        '苏尼特右旗人民法院': '3341532733',
        '内蒙古自治区兴安盟中级人民法院': '2631241398',
        '乌兰浩特市人民法院': '2639922563',
        '科尔沁右翼前旗人民法院': '2631071771',
        '突泉县人民法院': '2631101535',
        '科尔沁右翼中旗人民法院': '2634679744',
        '扎赉特旗人民法院': '2631201504'
    }
    HENANCOURT = {
        '河南省安阳市中级人民法院': '2010128026',
        '内黄县人民法院': '2046234119',
        '滑县人民法院': '2022228019',
        '安阳市龙安区人民法院': '2049099808',
        '安阳市北关区人民法院': '2060117420',
        '安阳市文峰区人民法院': '2049179366',
        '安阳市殷都区人民法院': '2076137938',
        '汤阴县人民法院': '2046205362',
        '安阳县人民法院': '2060136896',
        '林州市人民法院': '2060077531',
        '河南省鹤壁市中级人民法院': '2012481426',
        '鹤壁市淇滨区人民法院': '2049109824',
        '浚县人民法院': '2036417644',
        '鹤壁市山城区人民法院': '2036437217',
        '淇县人民法院': '2036397800',
        '鹤壁市鹤山区人民法院': '2036437212',
        '河南省济源中级人民法院': '2009798516',
        '济源市人民法院': '2036664215',
        '焦作市中级人民法院': '2012422215',
        '沁阳市人民法院': '2040186583',
        '焦作市解放区人民法院': '2040029684',
        '焦作市山阳区人民法院': '2040128284',
        '武陟县人民法院': '2046156842',
        '博爱县人民法院': '2080388107',
        '孟州市人民法院': '2036585559',
        '温县人民法院': '2049139581',
        '焦作市马村区人民法院': '2040305545',
        '焦作市中站区人民法院': '2040186584',
        '修武县人民法院': '2040314760',
        '河南省开封市中级人民法院': '2012684432',
        '兰考县人民法院': '2022321472',
        '杞县人民法院': '2049338258',
        '开封市金明区人民法院': '2046147113',
        '尉氏县人民法院': '2046176346',
        '开封市顺河回族区人民法院': '2046166734',
        '通许县人民法院': '2046234175',
        '开封市鼓楼区人民法院': '2049338260',
        '开封市祥符区人民法院': '2046156957',
        '开封市龙亭区人民法院': '2049298754',
        '开封市禹王台区人民法院': '2049219416',
        '河南省漯河市中级人民法院': '2012382831',
        '漯河市郾城区人民法院': '2959152701',
        '漯河市源汇区人民法院': '2964190132',
        '漯河市召陵区人民法院': '3000306576',
        '临颍县人民法院': '2967690028',
        '舞阳县人民法院': '2963763078',
        '河南省洛阳市中级人民法院': '2012461641',
        '嵩县人民法院': '2028090870',
        '栾川县人民法院': '2027639520',
        '伊川县人民法院': '2027629697',
        '偃师市人民法院': '2030231639',
        '孟津县人民法院': '2027679014',
        '洛阳市西工区人民法院': '2027698626',
        '洛阳市涧西区人民法院': '2036417652',
        '宜阳县人民法院': '2028100528',
        '洛阳市瀍河回族区人民法院': '2027649365',
        '洛阳市老城区人民法院': '2027718380',
        '新安县人民法院': '2027708565',
        '洛阳市洛龙区人民法院': '2027718379',
        '汝阳县人民法院': '2030129239',
        '洛阳高新技术产业开发区人民法院': '2027679016',
        '洛阳市吉利区人民法院': '2028061386',
        '洛宁县人民法院': '2028081041',
        '河南省南阳市中级人民法院': '2009769253',
        '南阳市卧龙区人民法院': '2040167522',
        '桐柏县人民法院': '2027659422',
        '西峡县人民法院': '2027629708',
        '方城县人民法院': '2027688606',
        '内乡县人民法院': '2021232289',
        '新野县人民法院': '2022218686',
        '唐河县人民法院': '2027629702',
        '淅川县人民法院': '2023836859',
        '镇平县人民法院': '2022228293',
        '南阳市宛城区人民法院': '2036339706',
        '社旗县人民法院': '2036388181',
        '邓州市人民法院': '2022350631',
        '南召县人民法院': '2036634804',
        '河南省濮阳市中级人民法院': '2010157508',
        '濮阳市华龙区人民法院': '2019876728',
        '清丰县人民法院': '2027649369',
        '台前县人民法院': '2019848303',
        '濮阳县人民法院': '2019915404',
        '南乐县人民法院': '2022360221',
        '范县人民法院': '2019848280',
        '平顶山市中级人民法院': '2014980886',
        '汝州市人民法院': '2028100525',
        '平顶山市湛河区人民法院': '2036427627',
        '鲁山县人民法院': '2027708676',
        '平顶山市新华区人民法院': '2027639515',
        '宝丰县人民法院': '2036634802',
        '平顶山市石龙区人民法院': '2040176763',
        '郏县人民法院': '2040226271',
        '舞钢市人民法院': '2036339693',
        '平顶山市卫东区人民法院': '2060057936',
        '叶县人民法院': '2036359066',
        '河南省三门峡市中级人民法院': '2009749741',
        '三门峡市湖滨区人民法院': '2036516458',
        '渑池县人民法院': '2036496501',
        '灵宝市人民法院': '2036397796',
        '义马市人民法院': '2036359061',
        '三门峡市陕州区人民法院': '2036664214',
        '卢氏县人民法院': '2036605476',
        '商丘市中级人民法院': '2012694284',
        '商丘市梁园区人民法院': '2021143562',
        '虞城县人民法院': '2021172891',
        '商丘市睢阳区人民法院': '2021124430',
        '永城市人民法院': '2019905862',
        '柘城县人民法院': '2022330942',
        '宁陵县人民法院': '2021094416',
        '夏邑县人民法院': '2022247077',
        '民权县人民法院': '2021261174',
        '睢县人民法院': '2051463020',
        '许昌市中级人民法院': '2005102619',
        '襄城县人民法院': '2005628214',
        '禹州市人民法院': '2036506352',
        '许昌市魏都区人民法院': '2040324527',
        '长葛市人民法院': '2049258825',
        '许昌市建安区人民法院': '2036359058',
        '鄢陵县人民法院': '2086461842',
        '河南省信阳市中级人民法院': '2005548528',
        '新县人民法院': '2058217389',
        '息县人民法院': '2063365339',
        '信阳市平桥区人民法院': '2058257017',
        '固始县人民法院': '2027659416',
        '光山县人民法院': '2056227460',
        '潢川县人民法院': '2058365163',
        '信阳市浉河区人民法院': '2072500321',
        '淮滨县人民法院': '2058345489',
        '商城县人民法院': '2063345567',
        '罗山县人民法院': '2056158843',
        '河南省新乡市中级人民法院': '2010078445',
        '新乡市红旗区人民法院': '2051482581',
        '延津县人民法院': '2049367677',
        '新乡县人民法院': '2072309301',
        '辉县市人民法院': '2023866012',
        '卫辉市人民法院': '2023846248',
        '原阳县人民法院': '2023905607',
        '新乡市牧野区人民法院': '2046137280',
        '新乡市卫滨区人民法院': '2028081044',
        '封丘县人民法院': '2036496516',
        '获嘉县人民法院': '2046109179',
        '新乡市凤泉区人民法院': '2027669151',
        '长垣县人民法院': '2049268935',
        '河南省郑州市中级人民法院': '1991614219',
        '郑州铁路运输中级法院': '2010207581',
        '郑州市金水区人民法院': '2030168435',
        '郑州高新技术产业开发区人民法院': '2027747898',
        '郑州市管城回族区人民法院': '2027649358',
        '郑州市二七区人民法院': '2036664231',
        '新密市人民法院': '2009910121',
        '巩义市人民法院': '2036634808',
        '登封市人民法院': '2022139738',
        '新郑市人民法院': '2072461411',
        '郑州市中原区人民法院': '2027806780',
        '郑州市惠济区人民法院': '2028100540',
        '荥阳市人民法院': '2027679019',
        '中牟县人民法院': '2022228237',
        '郑州市上街区人民法院': '2027669135',
        '郑州航空港经济综合实验区人民法院': '2817401496',
        '河南省驻马店市中级人民法院': '2010088413',
        '驻马店市驿城区人民法院': '2036615343',
        '正阳县人民法院': '2040147578',
        '上蔡县人民法院': '2063355397',
        '泌阳县人民法院': '2036585554',
        '遂平县人民法院': '2036359070',
        '平舆县人民法院': '2036496511',
        '确山县人民法院': '2040137981',
        '西平县人民法院': '2036506348',
        '汝南县人民法院': '2051363784',
        '新蔡县人民法院': '2022979736',
        '河南省周口市中级人民法院': '2012694235',
        '周口市川汇区人民法院': '2076187981',
        '商水县人民法院': '2058227155',
        '西华县人民法院': '2049099803',
        '淮阳县人民法院': '2080318581',
        '郸城县人民法院': '2072349254',
        '项城市人民法院': '2066132235',
        '鹿邑县人民法院': '2022139919',
        '太康县人民法院': '2066132234',
        '扶沟县人民法院': '2072328968',
        '沈丘县人民法院': '2080338631'
    }
    HEBEICOURT = {
        '河北省保定市中级人民法院': '2554669504',
        '安新县人民法院': '2578833930',
        '保定市竞秀区人民法院': '2754602451',
        '保定市莲池区人民法院': '2627525630',
        '安国市人民法院': '2576000038',
        '高阳县人民法院': '2754453038',
        '易县人民法院': '2754552577',
        '涞源县人民法院': '2575517708',
        '清苑县人民法院': '2581757043',
        '唐县人民法院': '2613194059',
        '曲阳县人民法院': '2754572587',
        '徐水县人民法院': '2628870728',
        '涿州市人民法院': '2754681836',
        '雄县人民法院': '2754661968',
        '顺平县人民法院': '2754423460',
        '保定市满城区人民法院': '2754463141',
        '蠡县人民法院': '2754403879',
        '博野县人民法院': '2584742460',
        '容城县人民法院': '2754711598',
        '阜平县人民法院': '2590340901',
        '望都县人民法院': '2530122232',
        '定州市人民法院': '2627983782',
        '定兴县人民法院': '2754502755',
        '涞水县人民法院': '2754097554',
        '高碑店市人民法院': '2628555296',
        '围场满族蒙古族自治县人民法院': '2587340904',
        '宽城满族自治县人民法院': '3037692908',
        '兴隆县人民法院': '3246755906',
        '丰宁满族自治县人民法院': '2885985925',
        '承德市双桥区人民法院': '3295028826',
        '滦平县人民法院': '3403440308',
        '青县人民法院': '3207906277',
        '任丘市人民法院': '2731987732',
        '沧州市运河区人民法院': '2636605839',
        '南皮县人民法院': '3221038418',
        '孟村回族自治县人民法院': '3251183050',
        '黄骅市人民法院': '3416747987',
        '泊头市人民法院': '3204299784',
        '吴桥县人民法院': '3208690481',
        '肃宁县人民法院': '3190894676',
        '海兴县人民法院': '3193508822',
        '河北省衡水市中级人民法院': '2617211631',
        '衡水市桃城区人民法院': '2660224612',
        '安平县人民法院': '2662157974',
        '景县人民法院': '2659338414',
        '武强县人民法院': '2659106770',
        '枣强县人民法院': '2659239958',
        '深州市人民法院': '2659397967',
        '武邑县人民法院': '2659957195',
        '故城县人民法院': '2646234712',
        '阜城县人民法院': '2663981595',
        '衡水市冀州区人民法院': '2676784309',
        '饶阳县人民法院': '2657469829',
        '河北省邯郸市中级人民法院': '3119209817',
        '邯郸市丛台区人民法院': '3307104168',
        '大名县人民法院': '3316706131',
        '邯郸市邯山区人民法院': '3296014313',
        '邯郸市峰峰矿区人民法院': '3325754594',
        '磁县人民法院': '3293548128',
        '广平县人民法院': '3307094477',
        '武安市人民法院': '2653509060',
        '邯郸市复兴区人民法院': '3263776602',
        '邯郸市肥乡区人民法院': '2664011404',
        '临漳县人民法院': '3254680502',
        '成安县人民法院': '3326483848',
        '永年县人民法院': '2843296889',
        '曲周县人民法院': '3300250240',
        '魏县人民法院': '3329184715',
        '邱县人民法院': '3362587029',
        '馆陶县人民法院': '3372342866',
        '涉县人民法院': '3319850966',
        '河北省廊坊市中级人民法院': '3177651611',
        '廊坊市广阳区人民法院': '3179864818',
        '大厂回族自治县人民法院': '2641832100',
        '廊坊市安次区人民法院': '3189070128',
        '大城县人民法院': '3179614058',
        '廊坊经济技术开发区人民法院': '2641562962',
        '香河县人民法院': '3175559532',
        '固安县人民法院': '3191750555',
        '文安县人民法院': '3201367146',
        '秦皇岛市海港区人民法院': '2636446864',
        '卢龙县人民法院': '3192062536',
        '秦皇岛市山海关区人民法院': '3230005005',
        '秦皇岛经济技术开发区人民法院': '3201781162',
        '河北省石家庄市中级人民法院': '2710930879',
        '石家庄市新华区人民法院': '2710652387',
        '石家庄市裕华区人民法院': '2671947041',
        '石家庄市桥西区人民法院': '2673877431',
        '石家庄高新技术产业开发区人民法院': '2672026556',
        '石家庄市长安区人民法院': '2710662446',
        '赵县人民法院': '2617211620',
        '晋州市人民法院': '2636466344',
        '石家庄市藁城区人民法院': '2698314393',
        '元氏县人民法院': '2664011453',
        '井陉县人民法院': '2698404256',
        '灵寿县人民法院': '2683051415',
        '新乐市人民法院': '2680480316',
        '石家庄市鹿泉区人民法院': '2670276795',
        '赞皇县人民法院': '2680292794',
        '深泽县人民法院': '2647973832',
        '正定县人民法院': '2710890993',
        '平山县人民法院': '2698274626',
        '行唐县人民法院': '2671947020',
        '辛集市人民法院': '3170113890',
        '石家庄市栾城区人民法院': '2675927248',
        '无极县人民法院': '2710582726',
        '石家庄市井陉矿区人民法院': '2681727324',
        '高邑县人民法院': '2662227534',
        '迁安市人民法院': '2640148802',
        '河北省邢台市中级人民法院': '3175599410',
        '沙河市人民法院': '3218314699',
        '邢台市桥西区人民法院': '3207965054',
        '邢台经济开发区人民法院': '3174964248',
        '宁晋县人民法院': '3201659001',
        '柏乡县人民法院': '3191675064',
        '清河县人民法院': '3249280593',
        '南宫市人民法院': '3165610048',
        '邢台县人民法院': '3175901425',
        '隆尧县人民法院': '3234503800',
        '巨鹿县人民法院': '3261226019',
        '任县人民法院': '3192106927',
        '新河县人民法院': '3377438096',
        '南和县人民法院': '3208034633',
        '威县人民法院': '3182676134',
        '内邱县人民法院': '3221226555',
        '广宗县人民法院': '3182221530',
        '临城县人民法院': '3207958198',
        '临西县人民法院': '3243549948',
        '平乡县人民法院': '3248046065',
        '张家口市宣化区人民法院': '2659318830',
        '张家口市桥西区人民法院': '2636307819',
        '蔚县人民法院': '3058113313',
        '涿鹿县人民法院': '3161920583',
        '康保县人民法院': '3204351339'
    }
    JIANGXICOURT = {
        '江西省高级人民法院':'3136106935',
        '江西省抚州市中级人民法院': '2194820494',
        '东乡县人民法院': '3180372150',
        '南丰县人民法院': '2743742120',
        '抚州市临川区人民法院': '3112386279',
        '广昌县人民法院': '3034790396',
        '南城县人民法院': '3175715756',
        '金溪县人民法院': '3165227257',
        '黎川县人民法院': '3236245643',
        '乐安县人民法院': '3182726101',
        '资溪县人民法院': '3040588200',
        '崇仁县人民法院': '3191690923',
        '宜黄县人民法院': '3159980613',
        '赣州市中级人民法院': '3159841659',
        '会昌县人民法院': '3249220334',
        '赣州市章贡区人民法院': '3166970829',
        '瑞金市人民法院': '3157335355',
        '赣州市南康区人民法院': '3165124552',
        '崇义县人民法院': '3161680490',
        '龙南县人民法院': '3249350082',
        '赣州经济技术开发区人民法院': '3170911533',
        '安远县人民法院': '3199722571',
        '于都县人民法院': '3166851100',
        '兴国县人民法院': '3166731511',
        '石城县人民法院': '3216542527',
        '定南县人民法院': '3175569596',
        '全南县人民法院': '3169966100',
        '大余县人民法院': '3165237365',
        '寻乌县人民法院': '3216642129',
        '上犹县人民法院': '3119580784',
        '信丰县人民法院': '3230743017',
        '宁都县人民法院': '3246333116',
        '赣县人民法院': '3192062529',
        '江西省吉安市中级人民法院': '3175036433',
        '吉水县人民法院': '2247427329',
        '安福县人民法院': '3218393365',
        '吉安市吉州区人民法院': '3182141854',
        '遂川县人民法院': '3216958090',
        '万安县人民法院': '3207945561',
        '吉安县人民法院': '3188918739',
        '吉安市青原区人民法院': '2683632844',
        '新干县人民法院': '3160696795',
        '峡江县人民法院': '3166801357',
        '永丰县人民法院': '3177635887',
        '井冈山市人民法院': '3039433462',
        '永新县人民法院': '3170004442',
        '泰和县人民法院': '3242786851',
        '江西省九江市中级人民法院': '2554489583',
        '武宁县人民法院': '3208179624',
        '瑞昌市人民法院': '2532237336',
        '庐山市人民法院': '2532456679',
        '九江市浔阳区人民法院': '2850723650',
        '九江市濂溪区人民法院': '2895347348',
        '九江县人民法院': '2834704517',
        '共青城市人民法院': '3229764810',
        '永修县人民法院': '2493816427',
        '彭泽县人民法院': '2891384896',
        '湖口县人民法院': '2824382199',
        '修水县人民法院': '2861795470',
        '德安县人民法院': '3300830715',
        '都昌县人民法院': '3191099076',
        '庐山人民法院': '3171375437',
        '江西省景德镇市中级人民法院': '3160045930',
        '乐平市人民法院': '3245688509',
        '景德镇市昌江区人民法院': '3230753000',
        '景德镇市珠山区人民法院': '3246303111',
        '浮梁县人民法院': '3241748556',
        '江西省南昌市中级人民法院': '3172019176',
        '南昌铁路运输中级法院': '3216445869',
        '南昌市西湖区人民法院': '3230723223',
        '南昌市青云谱区人民法院': '3207955376',
        '南昌县人民法院': '2658093200',
        '南昌市东湖区人民法院': '3170172215',
        '安义县人民法院': '3192102866',
        '南昌高新技术产业开发区人民法院': '3249414068',
        '南昌市青山湖区人民法院': '3191905793',
        '南昌市湾里区人民法院': '3177407771',
        '进贤县人民法院': '3177853655',
        '南昌市新建区人民法院': '2834773848',
        '南昌经济技术开发区人民法院': '3217096648',
        '江西省萍乡市中级人民法院': '3158272176',
        '芦溪县人民法院': '3119510934',
        '萍乡市安源区人民法院': '3025702521',
        '上栗县人民法院': '3205816140',
        '莲花县人民法院': '3172871964',
        '萍乡市湘东区人民法院': '3179594364',
        '江西省上饶市中级人民法院': '3166427473',
        '上饶县人民法院': '3179574409',
        '玉山县人民法院': '3165383994',
        '上饶市信州区人民法院': '3170015819',
        '德兴市人民法院': '3175777581',
        '弋阳县人民法院': '3166854510',
        '铅山县人民法院': '3166711568',
        '上饶市广丰区人民法院': '3161680481',
        '鄱阳县人民法院': '3190426147',
        '横峰县人民法院': '3190972368',
        '万年县人民法院': '3165252085',
        '婺源县人民法院': '3161567863',
        '余干县人民法院': '3166841172',
        '江西省新余市中级人民法院': '3160273469',
        '新余市渝水区人民法院': '3177397910',
        '分宜县人民法院': '3165324167',
        '江西省宜春市中级人民法院': '3160726260',
        '宜春市袁州区人民法院': '3161811324',
        '高安市人民法院': '2640148804',
        '万载县人民法院': '1951233663',
        '樟树市人民法院': '3169886393',
        '丰城市人民法院': '3025741416',
        '上高县人民法院': '3044869417',
        '奉新县人民法院': '3164716196',
        '宜丰县人民法院': '2525386399',
        '铜鼓县人民法院': '3165104737',
        '靖安县人民法院': '3094130638',
        '江西省鹰潭市中级人民法院': '3160981089',
        '鹰潭市月湖区人民法院': '3170871639',
        '余江县人民法院': '3175041815',
        '贵溪市人民法院': '3171751140'
    }
    SHANGXICOURT = {
        '山西省高级人民法院': '3246173936',
        '山西省大同市中级人民法院': '3174882768',
        '大同市城区人民法院': '3192167317',
        '灵丘县人民法院': '3207945642',
        '左云县人民法院': '3191158504',
        '大同市矿区人民法院': '3190654938',
        '大同县人民法院': '3175213518',
        '大同市南郊区人民法院': '3230167168',
        '浑源县人民法院': '3182696141',
        '大同市新荣区人民法院': '3193715768',
        '阳高县人民法院': '3243496218',
        '天镇县人民法院': '3246243139',
        '山西省晋城市中级人民法院': '3193880583',
        '晋城市城区人民法院': '3246163619',
        '泽州县人民法院': '3188908722',
        '阳城县人民法院': '3201822066',
        '陵川县人民法院': '3216433303',
        '山西省晋中市中级人民法院': '3217400850',
        '晋中市榆次区人民法院': '3296189214',
        '祁县人民法院': '3236678707',
        '太谷县人民法院': '3246323220',
        '昔阳县人民法院': '3277186171',
        '和顺县人民法院': '3251227583',
        '介休市人民法院': '3245518687',
        '灵石县人民法院': '3249334687',
        '寿阳县人民法院': '3245658632',
        '榆社县人民法院': '3247205382',
        '山西省临汾市中级人民法院': '3174828961',
        '临汾市尧都区人民法院': '3228577140',
        '侯马市人民法院': '3216473068',
        '曲沃县人民法院': '3217235265',
        '古县人民法院': '3214832687',
        '浮山县人民法院': '3216442757',
        '大宁县人民法院': '3190969535',
        '翼城县人民法院': '3189006822',
        '乡宁县人民法院': '3217215552',
        '襄汾县人民法院': '3218730233',
        '霍州市人民法院': '3232194318',
        '隰县人民法院': '3221126703',
        '洪洞县人民法院': '3307134072',
        '安泽县人民法院': '3201891911',
        '永和县人民法院': '3247175755',
        '山西省吕梁市中级人民法院': '3201919839',
        '兴县人民法院': '3254741167',
        '吕梁市离石区人民法院': '3234827533',
        '岚县人民法院': '3280357761',
        '中阳县人民法院': '3248989786',
        '柳林县人民法院': '3189195548',
        '临县人民法院': '3325784372',
        '汾阳市人民法院': '3217037115',
        '交口县人民法院': '3246223546',
        '文水县人民法院': '3192678036',
        '交城县人民法院': '3245728402',
        '山西省朔州市中级人民法院': '3243545800',
        '怀仁县人民法院': '3243635604',
        '朔州市朔城区人民法院': '2860200953',
        '山西省应县人民法院': '2408686333',
        '山阴县人民法院': '3248047558',
        '右玉县人民法院': '3243768763',
        '山西省太原市中级人民法院': '3295885498',
        '太原铁路运输中级法院': '3192955163',
        '太原市万柏林区人民法院': '3189334738',
        '太原市小店区人民法院': '3254036544',
        '太原市尖草坪区人民法院': '3229739610',
        '太原市迎泽区人民法院': '3208203542',
        '太原市晋源区人民法院': '3248046087',
        '太原市杏花岭区人民法院': '3327612306',
        '古交市人民法院': '3246592094',
        '清徐县人民法院': '3179658739',
        '阳曲县人民法院': '3229813641',
        '太原铁路运输法院': '3248037564',
        '山西省忻州市中级人民法院': '3229745296',
        '五寨县人民法院': '3243689757',
        '繁峙县人民法院': '3234318783',
        '忻州市忻府区人民法院': '3257749722',
        '定襄县人民法院': '3230514630',
        '岢岚县人民法院': '3251366923',
        '代县人民法院': '3234728152',
        '原平市人民法院': '3236245732',
        '保德县人民法院': '3277097054',
        '宁武县人民法院': '3230509157',
        '静乐县人民法院': '3301398828',
        '五台县人民法院': '2282822117',
        '神池县人民法院': '3182845641',
        '偏关县人民法院': '3230811204',
        '山西省运城市中级人民法院': '3175526511',
        '运城市盐湖区人民法院': '3246646449',
        '河津市人民法院': '3216376394',
        '稷山县人民法院': '3243729797',
        '万荣县人民法院': '3243579908',
        '夏县人民法院': '3216525522',
        '平陆县人民法院': '3243559858',
        '永济市人民法院': '2191949427',
        '临猗县人民法院': '2484383781',
        '闻喜县人民法院': '2458965066',
        '芮城县人民法院': '3243599630',
        '绛县人民法院': '3175665958',
        '垣曲县人民法院': '3243565769',
        '山西省阳泉市中级人民法院': '3179673814',
        '盂县人民法院': '3199549463',
        '平定县人民法院': '3247329138',
        '阳泉市郊区人民法院': '3193445722',
        '阳泉市城区人民法院': '3208216053',
        '阳泉市矿区人民法院': '3192042461',
        '山西省长治市中级人民法院': '3261265784',
        '长治市城区人民法院': '3252834741',
        '长治市郊区人民法院': '3257696012',
        '襄垣县人民法院': '3326681450',
        '潞城市人民法院': '3253103166',
        '屯留县人民法院': '3334311474'
    }
    SHANGXI2COURT = {
        '安康市中级人民法院': '3201575501',
        '安康市汉滨区人民法院': '2883233214',
        '旬阳县人民法院': '3201695805',
        '岚皋县人民法院': '3201816606',
        '平利县人民法院': '3207928554',
        '宁陕县人民法院': '3205696961',
        '陕西省宝鸡市中级人民法院': '3201602544',
        '陇县人民法院': '3193035105',
        '眉县人民法院': '3193374675',
        '宝鸡市陈仓区人民法院': '3172892579',
        '宝鸡市金台区人民法院': '3192975917',
        '凤翔县人民法院': '3192678763',
        '扶风县人民法院': '3193832969',
        '岐山县人民法院': '3193374688',
        '凤县人民法院': '3193035086',
        '太白县人民法院': '3193144947',
        '千阳县人民法院': '3193365530',
        '汉中市中级人民法院': '3199632994',
        '镇巴县人民法院': '3028253160',
        '西乡县人民法院': '3199722525',
        '南郑县人民法院': '3175644389',
        '洋县人民法院': '3172695917',
        '勉县人民法院': '3199613438',
        '陕西省商洛市中级人民法院': '3088769030',
        '山阳县人民法院': '3191646525',
        '商洛市商州区人民法院': '3161333620',
        '洛南县人民法院': '3205687101',
        '丹凤县人民法院': '3171220220',
        '商南县人民法院': '3191800387',
        '镇安县人民法院': '3199662689',
        '铜川市中级人民法院': '3179963829',
        '铜川市印台区人民法院': '3172753326',
        '铜川市耀州区人民法院': '3180250726',
        '铜川市王益区人民法院': '3180310592',
        '铜川市耀州区人民法院新区审判庭': '3180520714',
        '大荔县人民法院': '3190339096',
        '渭南市华州区人民法院': '3190458249',
        '富平县人民法院': '3190348989',
        '白水县人民法院': '3190438315',
        '韩城市人民法院': '3190468417',
        '澄城县人民法院': '3190398442',
        '蒲城县人民法院': '3190339091',
        '华阴市人民法院': '3190378822',
        '合阳县人民法院': '3190607702',
        '陕西省咸阳市中级人民法院': '3192013112',
        '咸阳市渭城区人民法院': '3193675845',
        '彬县人民法院': '3174954290',
        '兴平市人民法院': '3191953733',
        '长武县人民法院': '3192063001',
        '礼泉县人民法院': '3192184685',
        '陕西省西安市中级人民法院': '3144418528',
        '西安市碑林区人民法院': '3188957818',
        '西安市未央区人民法院': '3175176358',
        '西安市雁塔区人民法院': '3202067614',
        '西安市新城区人民法院': '3201794334',
        '户县人民法院': '3175766073',
        '西安市莲湖区人民法院': '3172519824',
        '西安市灞桥区人民法院': '3190438321',
        '西安市长安区人民法院': '3174937810',
        '西安市高陵区人民法院': '3182190490',
        '周至县人民法院': '2874318153',
        '西安市阎良区人民法院': '3182705981',
        '西安市临潼区人民法院': '3172629448',
        '蓝田县人民法院': '3193388285',
        '陕西省榆林市中级人民法院': '3177544997',
        '神木市人民法院': '2530401547',
        '府谷县人民法院': '3177396039',
        '榆林市榆阳区人民法院': '3177435586',
        '靖边县人民法院': '3177465559',
        '定边县人民法院': '3177425237',
        '清涧县人民法院': '3177546972',
        '子洲县人民法院': '3172922461',
        '米脂县人民法院': '3172872697',
        '佳县人民法院': '3177494991',
        '榆林市横山区人民法院': '3177507148',
        '吴堡县人民法院': '3177651885',
        '绥德县人民法院': '3177475380',
        '延安市中级人民法院': '3180371473',
        '富县人民法院': '3180102061',
        '延长县人民法院': '3180291647'
    }
    HUBEICOURT = {
        '湖北省汉江中级人民法院': '2208307162',
        '仙桃市人民法院': '2863068743',
        '潜江市人民法院': '2866332640',
        '天门市人民法院': '2885102141',
        '湖北省鄂州市中级人民法院': '2545716703',
        '鄂州市鄂城区人民法院': '2525376608',
        '鄂州市梁子湖区人民法院': '2641577330',
        '鄂州市华容区人民法院': '2553344637',
        '湖北省恩施土家族苗族自治州中级人民法院': '2545696710',
        '恩施市人民法院': '2938228579',
        '利川市人民法院': '3214843067',
        '建始县人民法院': '2907050405',
        '巴东县人民法院': '3201771909',
        '来凤县人民法院': '2945270469',
        '湖北省黄石市中级人民法院': '3108045531',
        '黄石市黄石港区人民法院': '3170949512',
        '大冶市人民法院': '2343549128',
        '黄石市下陆区人民法院': '3175596334',
        '黄石市铁山区人民法院': '3386964608',
        '黄石市西塞山区人民法院': '3172467975',
        '麻城市人民法院': '3199595573',
        '武穴市人民法院': '3234857629',
        '蕲春县人民法院': '3236858280',
        '黄冈市黄州区人民法院': '3214872398',
        '黄梅县人民法院': '3236828514',
        '团风县人民法院': '3230508579',
        '英山县人民法院': '3243679678',
        '湖北省荆门市中级人民法院': '2484981384',
        '京山县人民法院': '2885270629',
        '荆门市掇刀区人民法院': '2906940735',
        '沙洋县人民法院': '2926933502',
        '荆门市东宝区人民法院': '2949721493',
        '钟祥市人民法院': '3258516015',
        '荆州市沙市区人民法院': '3370570311',
        '湖北省十堰市中级人民法院': '2734799460',
        '十堰市茅箭区人民法院': '3087306546',
        '十堰市张湾区人民法院': '2734919074',
        '竹山县人民法院': '3172933828',
        '竹溪县人民法院': '3217176315',
        '十堰市郧阳区人民法院': '3189781635',
        '湖北省随州市中级人民法院': '2964099696',
        '随州市曾都区人民法院': '2964073590',
        '广水市人民法院': '2961149768',
        '随县人民法院': '2957172679',
        '湖北省武汉市中级人民法院': '2088392419',
        '武汉市江岸区人民法院': '2080358329',
        '武汉市江汉区人民法院': '2287412586',
        '武汉市硚口区人民法院': '2287342856',
        '武汉市洪山区人民法院': '2060048123',
        '武汉市武昌区人民法院': '2287282854',
        '武汉市江夏区人民法院': '2086372853',
        '武汉市青山区人民法院': '2289800349',
        '武汉市黄陂区人民法院': '2289367208',
        '武汉经济技术开发区人民法院': '2289467046',
        '武汉市东西湖区人民法院': '2291330469',
        '武汉市新洲区人民法院': '2290749928',
        '武汉市蔡甸区人民法院': '2294355322',
        '武汉市汉阳区人民法院': '2287382506',
        '武汉东湖新技术开发区人民法院': '2292156269',
        '武汉市汉南区人民法院': '2290759885',
        '武汉海事法院': '3339003421',
        '湖北省咸宁市中级人民法院': '2927241039',
        '通山县人民法院': '2240541752',
        '咸宁市咸安区人民法院': '2927051934',
        '通城县人民法院': '2561747801',
        '赤壁市人民法院': '2967964627',
        '嘉鱼县人民法院': '2912140006',
        '崇阳县人民法院': '2878811483',
        '湖北省孝感市中级人民法院': '2313857619',
        '孝感市孝南区人民法院': '2373342399',
        '大悟县人民法院': '2386921423',
        '汉川市人民法院': '2405226537',
        '安陆市人民法院': '2395380665',
        '云梦县人民法院': '2386911418',
        '应城市人民法院': '2405116835',
        '孝昌县人民法院': '2385067567',
        '湖北省襄阳市中级人民法院': '2966616268',
        '襄阳市樊城区人民法院': '2975495806',
        '襄阳高新技术产业开发区人民法院': '2975745084',
        '枣阳市人民法院': '2979965667',
        '老河口市人民法院': '2921541951',
        '襄阳市襄城区人民法院': '2975695278',
        '南漳县人民法院': '2979885754',
        '宜城市人民法院': '3021800002',
        '襄阳市襄州区人民法院': '2998021987',
        '保康县人民法院': '2979746813',
        '襄阳铁路运输法院': '3175782366',
        '谷城县人民法院': '3000088092',
        '湖北省宜昌市中级人民法院': '2429516458',
        '宜昌市夷陵区人民法院': '2657347553',
        '秭归县人民法院': '3171947413',
        '宜都市人民法院': '3243466405',
        '宜昌市西陵区人民法院': '3157176000',
        '宜昌市三峡坝区人民法院': '3081677956',
        '当阳市人民法院': '3074059690',
        '枝江市人民法院': '2182459731',
        '葛洲坝人民法院': '3175628972',
        '长阳土家自治县人民法院': '3214964038',
        '远安县人民法院': '3216497050',
        '兴山县人民法院': '3108085281',
        '宜昌市点军区人民法院': '3171828043'
    }
    HUNANCOURT = {
        '湖南省高级人民法院': '3077482550',
        '湖南省常德市中级人民法院': '3051737966',
        '澧县人民法院': '3043399646',
        '常德市武陵区人民法院': '3040818029',
        '临澧县人民法院': '3050744842',
        '石门县人民法院': '2689633792',
        '津市市人民法院': '3066803194',
        '汉寿县人民法院': '3076243848',
        '常德市鼎城区人民法院': '3075610980',
        '桃源县人民法院': '3087272810',
        '安乡县人民法院': '3074587580',
        '湖南省郴州市中级人民法院': '3063907811',
        '桂阳县人民法院': '3070188584',
        '郴州市苏仙区人民法院': '3063997030',
        '郴州市北湖区人民法院': '3069615038',
        '宜章县人民法院': '3064978772',
        '资兴市人民法院': '3044114342',
        '永兴县人民法院': '3040318198',
        '安仁县人民法院': '3064864583',
        '汝城县人民法院': '3064014930',
        '临武县人民法院': '3064123299',
        '嘉禾县人民法院': '3064053937',
        '湖南省怀化市中级人民法院': '3074179362',
        '怀化市鹤城区人民法院': '2208077162',
        '麻阳苗族自治县人民法院': '3075590978',
        '洪江市人民法院': '2873658232',
        '新晃侗族自治县人民法院': '3066593765',
        '溆浦县人民法院': '3108035490',
        '通道侗族自治县人民法院': '2850772358',
        '会同县人民法院': '3058113286',
        '沅陵县人民法院': '2260108448',
        '芷江侗族自治县人民法院': '2879326779',
        '靖州苗族侗族自治县人民法院': '2731917989',
        '怀化铁路运输法院': '3355176027',
        '洪江人民法院': '2878122116',
        '辰溪县人民法院': '3045411393',
        '中方县人民法院': '3075740552',
        '湖南省衡阳市中级人民法院': '2957311065',
        '衡阳市雁峰区人民法院': '3175645866',
        '衡阳市蒸湘区人民法院': '3119500974',
        '常宁市人民法院': '3074817062',
        '衡阳县人民法院': '3075351787',
        '耒阳市人民法院': '3028133565',
        '衡阳市石鼓区人民法院': '3179746495',
        '衡阳市珠晖区人民法院': '3179594359',
        '衡阳市南岳区人民法院': '2676544844',
        '衡东县人民法院': '2990790107',
        '衡南县人民法院': '3208104058',
        '衡山县人民法院': '3170125397',
        '祁东县人民法院': '2996981910',
        '娄底市中级人民法院': '3052831435',
        '双峰县人民法院': '3044244246',
        '涟源市人民法院': '3066290013',
        '冷水江市人民法院': '3045380471',
        '新化县人民法院': '3076863163',
        '娄底市娄星区人民法院': '3074679413',
        '湖南省邵阳市中级人民法院': '3048282280',
        '邵东县人民法院': '3053137220',
        '洞口县人民法院': '3070301118',
        '邵阳市大祥区人民法院': '3063937753',
        '隆回县人民法院': '3064043981',
        '新宁县人民法院': '3065164586',
        '武冈市人民法院': '3174942253',
        '邵阳市双清区人民法院': '3070129247',
        '邵阳县人民法院': '3171999094',
        '邵阳市北塔区人民法院': '3251986014',
        '绥宁县人民法院': '3052736898',
        '湖南省湘西土家族苗族自治州中级人民法院': '3044134259',
        '泸溪县人民法院': '3044184277',
        '保靖县人民法院': '3044254028',
        '吉首市人民法院': '3045271184',
        '永顺县人民法院': '3044274142',
        '湘潭市中级人民法院': '3048416710',
        '湘潭县人民法院': '3052831431',
        '湘潭市岳塘区人民法院': '3053021354',
        '湘乡市人民法院': '3064917098',
        '湘潭市雨湖区人民法院': '3052961411',
        '韶山市人民法院': '3053107206',
        '湖南省益阳市中级人民法院': '3070328829',
        '南县人民法院': '2671223030',
        '益阳市赫山区人民法院': '3069702245',
        '沅江市人民法院': '3072252468',
        '益阳市资阳区人民法院': '3065545695',
        '桃江县人民法院': '3078999173',
        '大通湖管理区人民法院': '3074549509',
        '安化县人民法院': '3070259221',
        '湖南省岳阳市中级人民法院': '3040588202',
        '华容县人民法院': '2698443730',
        '湘阴县人民法院': '3050625535',
        '岳阳县人民法院': '3171909459',
        '临湘市人民法院': '3172103779',
        '汨罗市人民法院': '3172113313',
        '岳阳市岳阳楼区人民法院': '3077103060',
        '平江县人民法院': '3191943490',
        '岳阳市君山区人民法院': '3431078747',
        '岳阳市云溪区人民法院': '3171533525',
        '湖南省永州市中级人民法院': '3044699559',
        '永州市零陵区人民法院': '3052520026',
        '永州市冷水滩区人民法院': '3043399650',
        '宁远县人民法院': '3063937749',
        '东安县人民法院': '3057944264',
        '道县人民法院': '3043279991',
        '双牌县人民法院': '3044699561',
        '祁阳县人民法院': '3064123207',
        '江永县人民法院': '3045291352',
        '江华瑶族自治县人民法院': '3050505657',
        '新田县人民法院': '3050734794',
        '蓝山县人民法院': '3053311910',
        '湖南省长沙市中级人民法院': '3048038560',
        '长沙市岳麓区人民法院': '2585288149',
        '浏阳市人民法院': '3075391668',
        '长沙市天心区人民法院': '3065171195',
        '长沙市芙蓉区人民法院': '3070139428',
        '长沙市开福区人民法院': '3064053931',
        '长沙县人民法院': '3049040734',
        '长沙市雨花区人民法院': '3065185754',
        '长沙市望城区人民法院': '3074139375',
        '宁乡县人民法院': '3066833206',
        '湖南省株洲市中级人民法院': '3064801065',
        '株洲市天元区人民法院': '3043870053',
        '株洲市石峰区人民法院': '3067800320',
        '攸县人民法院': '3040219531',
        '株洲市芦淞区人民法院': '3079238758',
        '醴陵市人民法院': '3066001073',
        '株洲市荷塘区人民法院': '3071238516',
        '株洲县人民法院': '3063868121',
        '茶陵县人民法院': '3066633601',
        '炎陵县人民法院': '3070666550',
        '湖南省张家界市中级人民法院': '3080061871',
        '慈利县人民法院': '3077312898',
        '桑植县人民法院': '3076152553',
        '张家界市武陵源区人民法院': '3076853179',
        '张家界市永定区人民法院': '3077602541'
    }
    GUANGDONGCOURT = {
        '广州铁路运输中级法院': '2542078679',
        '广州海事法院': '2536838800',
        '广东省潮州市中级人民法院': '2547732092',
        '潮州市湘桥区人民法院': '2644697384',
        '潮州市潮安区人民法院': '2647378089',
        '饶平县人民法院': '2659552438',
        '潮州市枫溪人民法院': '2698164434',
        '广东省东莞市中级人民法院': '2549590676',
        '东莞市第一人民法院': '2432374005',
        '东莞市第二人民法院': '2542198594',
        '东莞市第三人民法院': '2541150516',
        '广东省佛山市中级人民法院': '2546550531',
        '佛山市顺德区人民法院': '2126503952',
        '佛山市禅城区人民法院': '2639942527',
        '佛山市南海区人民法院': '2657456200',
        '佛山市三水区人民法院': '2562733110',
        '佛山市高明区人民法院': '2620669850',
        '广东省广州市中级人民法院': '2555060371',
        '广州市从化区人民法院': '3165152278',
        '广州市天河区人民法院': '2879138138',
        '广州市黄埔区人民法院': '3175772743',
        '广州市番禺区人民法院': '3177497216',
        '广州市越秀区人民法院': '2966568292',
        '广州市花都区人民法院': '3109166724',
        '广州市海珠区人民法院': '3174996763',
        '广州市荔湾区人民法院': '3199712558',
        '广州市增城区人民法院': '3081615472',
        '广州市白云区人民法院': '3258602408',
        '广州市南沙区人民法院': '3201692298',
        '广州铁路运输第二法院': '3390463681',
        '广东省惠州市中级人民法院': '2548541351',
        '惠州市惠城区人民法院': '2647748236',
        '博罗县人民法院': '2483101004',
        '惠东县人民法院': '2654621549',
        '惠州市大亚湾经济技术开发区人民法院': '2619684150',
        '惠州市惠阳区人民法院': '2648682569',
        '龙门县人民法院': '2652420037',
        '广东省河源市中级人民法院': '2542039001',
        '东源县人民法院': '2766292710',
        '河源市源城区人民法院': '2879028741',
        '龙川县人民法院': '2821805877',
        '紫金县人民法院': '2763428663',
        '连平县人民法院': '2766422202',
        '和平县人民法院': '2785012270',
        '广东省揭阳市中级人民法院': '2539523184',
        '惠来县人民法院': '2593852854',
        '揭阳市榕城区人民法院': '2593772982',
        '揭阳市揭东区人民法院': '2593783103',
        '普宁市人民法院': '2619916226',
        '揭西县人民法院': '2645577747',
        '广东省江门市中级人民法院': '2550016908',
        '江门市新会区人民法院': '2712080323',
        '江门市蓬江区人民法院': '2691716760',
        '开平市人民法院': '2684735585',
        '鹤山市人民法院': '2810381315',
        '江门市江海区人民法院': '2681563179',
        '台山市人民法院': '2974470588',
        '恩平市人民法院': '2681926672',
        '广东省茂名市中级人民法院': '2546141725',
        '茂名市茂南区人民法院': '2540979046',
        '茂名市电白区人民法院': '2536048951',
        '信宜市人民法院': '2578534935',
        '化州市人民法院': '2536378526',
        '高州市人民法院': '775471267',
        '梅州市梅江区人民法院': '3047988594',
        '梅州市梅县区人民法院': '3038065920',
        '大埔县人民法院': '3071002451',
        '丰顺县人民法院': '3129380101',
        '兴宁市人民法院': '3086532529',
        '平远县人民法院': '3040876197',
        '五华县人民法院': '3045471992',
        '广东省清远市中级人民法院': '2540362057',
        '清远市清城区人民法院': '3189592263',
        '阳山县人民法院': '2966597651',
        '清远市清新区人民法院': '2990199910',
        '连州市人民法院': '2967521189',
        '英德市人民法院': '3204229836',
        '佛冈县人民法院': '2976040150',
        '连山壮族瑶族自治县人民法院': '2974410797',
        '连南瑶族自治县人民法院': '2966617504',
        '广东省深圳市中级人民法院': '2563567415',
        '深圳市罗湖区人民法院': '2176894581',
        '深圳市福田区人民法院': '3076754878',
        '深圳市龙岗区人民法院': '3164636299',
        '深圳市宝安区人民法院': '3077362809',
        '深圳市盐田区人民法院': '1992554342',
        '深圳市南山区人民法院': '3043260320',
        '深圳前海合作区人民法院': '3182154033',
        '广东省汕头市中级人民法院': '2540352128',
        '汕头市濠江区人民法院': '3175606090',
        '汕头市澄海区人民法院': '3190438319',
        '汕头市龙湖区人民法院': '3190538108',
        '汕头市金平区人民法院': '3329322944',
        '汕头市潮阳区人民法院': '3294869980',
        '南澳县人民法院': '3431511749',
        '广东省汕尾市中级人民法院': '2556667846',
        '汕尾市城区人民法院': '2689512463',
        '陆河县人民法院': '3171977251',
        '海丰县人民法院': '2851120761',
        '陆丰市人民法院': '3180021153',
        '广东省韶关市中级人民法院': '2654873163',
        '乐昌市人民法院': '2942673973',
        '乳源瑶族自治县人民法院': '2947929829',
        '韶关市浈江区人民法院': '2945769236',
        '韶关市武江区人民法院': '2954230438',
        '仁化县人民法院': '2946071856',
        '始兴县人民法院': '2947847277',
        '韶关市曲江区人民法院': '2949621667',
        '南雄市人民法院': '2949877821',
        '新丰县人民法院': '2943681793',
        '翁源县人民法院': '2949201691',
        '广东省云浮市中级人民法院': '2555795573',
        '云浮市云城区人民法院': '2603964136',
        '郁南县人民法院': '2640084115',
        '新兴县人民法院': '2674378487',
        '云浮市云安区人民法院': '2527410985',
        '罗定市人民法院': '2607320904',
        '阳江市中级人民法院': '2562673270',
        '阳江市江城区人民法院': '2657326862',
        '阳江市阳东区人民法院': '3166407738',
        '阳春市人民法院': '2657793959',
        '阳西县人民法院': '3234378407',
        '广东省中山市中级人民法院': '2562513809',
        '中山市第一人民法院': '1901625948',
        '中山市第二人民法院': '2535834002',
        '广东省肇庆市中级人民法院': '2540278155',
        '肇庆市端州区人民法院': '2536108719',
        '德庆县人民法院': '2539523191',
        '肇庆市高要区人民法院': '2536378493',
        '四会市人民法院': '2540487408',
        '广宁县人民法院': '2540417490',
        '肇庆市鼎湖区人民法院': '2536328478',
        '封开县人民法院': '2536338528',
        '怀集县人民法院': '2540417509',
        '广东省湛江市中级人民法院': '2540978949',
        '湛江市赤坎区人民法院': '3071022581',
        '湛江市霞山区人民法院': '3064005099',
        '湛江经济技术开发区人民法院': '3175488151',
        '廉江市人民法院': '3177447480',
        '遂溪县人民法院': '3044254019',
        '雷州市人民法院': '3051578390',
        '吴川市人民法院': '3175861664',
        '湛江市坡头区人民法院': '3172047159',
        '徐闻县人民法院': '3074789118',
        '湛江市麻章区人民法院': '3053331331',
        '广东省珠海市中级人民法院': '2546271263',
        '珠海市香洲区人民法院': '3038280342',
        '珠海市金湾区人民法院': '3037921855',
        '珠海市斗门区人民法院': '3037829808',
        '珠海横琴新区人民法院': '3038046314'
    }
    ZHEJIANGCOURT = {
        '宁波海事法院': '1667918161',
        '浙江省杭州市中级人民法院': '1656917564',
        '杭州市萧山区人民法院': '1024161070',
        '杭州市余杭区人民法院': '1935409001',
        '杭州市下城区人民法院': '1919395196',
        '建德市人民法院': '1916018253',
        '杭州市上城区人民法院': '1796243773',
        '杭州市富阳区人民法院': '1045340862',
        '杭州市西湖区人民法院': '1108789892',
        '杭州市江干区人民法院': '1947270314',
        '临安市人民法院': '1927267444',
        '杭州市拱墅区人民法院': '1950129019',
        '淳安县人民法院': '1925601683',
        '桐庐县人民法院': '1911134024',
        '杭州市滨江区人民法院': '1923199284',
        '杭州经济技术开发区人民法院': '1919425100',
        '杭州铁路运输法院': '3053097947',
        '浙江省湖州市中级人民法院': '1666488501',
        '湖州市吴兴区人民法院': '1041658545',
        '长兴县人民法院': '1901711549',
        '安吉县人民法院': '1874052264',
        '湖州市南浔区人民法院': '1102109097',
        '德清县人民法院': '1683963037',
        '浙江省嘉兴市中级人民法院': '1668046282',
        '嘉兴市南湖区人民法院': '1870821764',
        '嘉善县人民法院': '1892407611',
        '海宁市人民法院': '1026382869',
        '嘉兴市秀洲区人民法院': '1873817579',
        '平湖市人民法院': '1041469956',
        '桐乡市人民法院': '727159429',
        '海盐县人民法院': '1882794118',
        '浙江省金华市中级人民法院': '1666399500',
        '义乌市人民法院': '1075998691',
        '金华市婺城区人民法院': '2073605338',
        '永康市人民法院': '2021124340',
        '东阳市人民法院': '1695811410',
        '浦江县人民法院': '1638291036',
        '兰溪市人民法院': '1991633391',
        '武义县人民法院': '2126563292',
        '金华市金东区人民法院': '1041504916',
        '磐安县人民法院': '2324557762',
        '浙江省丽水市中级人民法院': '1668007036',
        '丽水市莲都区人民法院': '1041162737',
        '遂昌县人民法院': '1942396733',
        '青田县人民法院': '1045311654',
        '龙泉市人民法院': '2146454066',
        '缙云县人民法院': '2175236659',
        '松阳县人民法院': '1987754777',
        '庆元县人民法院': '2436445108',
        '云和县人民法院': '2429432647',
        '景宁畲族自治县人民法院': '2502080628',
        '浙江省宁波市中级人民法院': '1049747033',
        '宁波市鄞州区人民法院': '829089080',
        '宁波市北仑区人民法院': '829073545',
        '余姚市人民法院': '3247374529',
        '慈溪市人民法院': '3257508270',
        '象山县人民法院': '3299472626',
        '宁波市江北区人民法院': '3242956111',
        '宁波市镇海区人民法院': '3252964063',
        '宁海县人民法院': '3242612387',
        '宁波市海曙区人民法院': '3254770736',
        '宁波市奉化区人民法院': '3247668545',
        '浙江省衢州市中级人民法院': '1656987157',
        '衢州市柯城区人民法院': '1041041819',
        '江山市人民法院': '1802658144',
        '常山县人民法院': '1900630710',
        '衢州市衢江区人民法院': '2242547462',
        '龙游县人民法院': '2136445119',
        '开化县人民法院': '2012412415',
        '浙江省绍兴市中级人民法院': '1673161222',
        '诸暨市人民法院': '1045496857',
        '绍兴市越城区人民法院': '1677614132',
        '绍兴市柯桥区人民法院': '1044831374',
        '绍兴市上虞区人民法院': '1721523756',
        '嵊州市人民法院': '1911231670',
        '新昌县人民法院': '1923101589',
        '浙江省台州市中级人民法院': '1683804893',
        '台州市椒江区人民法院': '1109784738',
        '玉环市人民法院': '1061156761',
        '台州市路桥区人民法院': '2255834386',
        '温岭市人民法院': '2289320759',
        '台州市黄岩区人民法院': '2294265452',
        '临海市人民法院': '1042018813',
        '天台县人民法院': '2436435165',
        '三门县人民法院': '1104179362',
        '仙居县人民法院': '2436525072',
        '浙江省温州市中级人民法院': '1625235485',
        '温州市鹿城区人民法院': '1643011866',
        '瑞安市人民法院': '1065593384',
        '苍南县人民法院': '1644652216',
        '乐清市人民法院': '1644592381',
        '温州市龙湾区人民法院': '1644552545',
        '平阳县人民法院': '1644612392',
        '温州市瓯海区人民法院': '1674532586',
        '永嘉县人民法院': '1041041814',
        '泰顺县人民法院': '1644532883',
        '文成县人民法院': '1957707030',
        '温州市洞头区人民法院': '1946921940',
        '浙江省舟山市中级人民法院': '1683923672',
        '舟山市普陀区人民法院': '1041857527',
        '舟山市定海区人民法院': '1102261342',
        '岱山县人民法院': '2073497479',
        '嵊泗县人民法院': '2072480734'
    }
    JIANGSUCOURT = {
        '江苏省高级人民法院': '1961971240',
        '江苏省常州市中级人民法院': '1927296446',
        '溧阳市人民法院': '1934418959',
        '常州市钟楼区人民法院': '1934428262',
        '常州市天宁区人民法院': '1932856512',
        '常州市武进区人民法院': '1935418317',
        '常州市新北区人民法院': '1927286365',
        '常州市金坛区人民法院': '1932818048',
        '常州经济开发区人民法院': '1927365431',
        '江苏省淮安市中级人民法院': '1919415032',
        '淮安市清河区人民法院': '1941099096',
        '盱眙县人民法院': '1939594900',
        '金湖县人民法院': '1964397371',
        '涟水县人民法院': '1934747349',
        '淮安经济技术开发区人民法院': '1963681122',
        '淮安市洪泽区人民法院': '1963671144',
        '淮安市淮阴区人民法院': '1950148957',
        '淮安市淮安区人民法院': '1961921933',
        '淮安市清浦区人民法院': '1942416754',
        '淮安市清江浦区人民法院': '3309088898',
        '江苏省连云港市中级人民法院': '1928542552',
        '连云港市海州区人民法院': '1934428668',
        '连云港市赣榆区人民法院': '1934737396',
        '连云港市连云区人民法院': '1934737418',
        '东海县人民法院': '1934408998',
        '灌南县人民法院': '1934438357',
        '灌云县人民法院': '1951312027',
        '连云港市新浦区人民法院': '1935399035',
        '江苏省南京市中级人民法院': '1934457578',
        '南京市鼓楼区人民法院': '1957658819',
        '南京市秦淮区人民法院': '2604738081',
        '南京市江宁区人民法院': '1957668705',
        '南京市栖霞区人民法院': '3216554287',
        '南京市浦口区人民法院': '2771731418',
        '南京市玄武区人民法院': '3201901953',
        '南京市六合区人民法院': '3191706476',
        '南京市高淳区人民法院': '3204190086',
        '南京市溧水区人民法院': '3201239112',
        '南京市建邺区人民法院': '3228526231',
        '南京市雨花台区人民法院': '3199842137',
        '南京铁路运输法院': '3179384524',
        '江苏省南通市中级人民法院': '1934428402',
        '南通市通州区人民法院': '1985496679',
        '南通市崇川区人民法院': '1934767251',
        '海门市人民法院': '1991643303',
        '如皋市人民法院': '1941196736',
        '海安县人民法院': '1960914388',
        '启东市人民法院': '1934747782',
        '如东县人民法院': '1950210076',
        '南通市港闸区人民法院': '1957746046',
        '南通经济技术开发区人民法院': '1991527694',
        '宿迁市中级人民法院': '1925542276',
        '泗洪县人民法院': '1927345928',
        '沭阳县人民法院': '1934737706',
        '宿迁市宿城区人民法院': '1927316581',
        '泗阳县人民法院': '1927286318',
        '宿迁市宿豫区人民法院': '1925581757',
        '江苏省苏州市中级人民法院': '1939516117',
        '苏州市吴江区人民法院': '1939643683',
        '苏州工业园区人民法院': '1939614254',
        '常熟市人民法院': '1939643547',
        '张家港市人民法院': '1939565447',
        '昆山市人民法院': '1939516107',
        '苏州市姑苏区人民法院': '1939516075',
        '太仓市人民法院': '1939624068',
        '苏州市吴中区人民法院': '1939525676',
        '苏州市虎丘区人民法院': '1939614122',
        '苏州市相城区人民法院': '1939595127',
        '江苏省泰州市中级人民法院': '1925494467',
        '兴化市人民法院': '1942307636',
        '靖江市人民法院': '1939565133',
        '泰兴市人民法院': '1939565107',
        '泰州市海陵区人民法院': '1942347243',
        '泰州市姜堰区人民法院': '1934825712',
        '泰州市高港区人民法院': '1939565169',
        '泰州医药高新技术产业开发区人民法院': '1935408897',
        '江苏省无锡市中级人民法院': '1934398609',
        '宜兴市人民法院': '1935369794',
        '江阴市人民法院': '1934727884',
        '无锡市梁溪区人民法院': '2979340076',
        '无锡市锡山区人民法院': '2003253477',
        '无锡市崇安区人民法院': '2001032149',
        '江苏省无锡市惠山区人民法院': '2011259969',
        '无锡市滨湖区人民法院': '2001052073',
        '无锡市新吴区人民法院': '2005687610',
        '无锡市南长区人民法院': '1963851097',
        '无锡市北塘区人民法院': '2009729976',
        '江苏省徐州市中级人民法院': '1925503089',
        '徐州市泉山区人民法院': '1941158108',
        '新沂市人民法院': '1950220022',
        '徐州市铜山区人民法院': '1942357293',
        '徐州市云龙区人民法院': '1942347184',
        '邳州市人民法院': '1987841435',
        '徐州市鼓楼区人民法院': '1934756973',
        '睢宁县人民法院': '1927345884',
        '徐州市贾汪区人民法院': '1934398580',
        '丰县人民法院': '1983470203',
        '沛县人民法院': '1942347293',
        '徐州经济技术开发区人民法院': '1968151627',
        '徐州铁路运输法院': '3065193524',
        '江苏省盐城市中级人民法院': '1927267408',
        '盐城市亭湖区人民法院': '1926826959',
        '东台市人民法院': '1939613941',
        '盐城市大丰区人民法院': '1935418361',
        '阜宁县人民法院': '1939613920',
        '盐城市盐都区人民法院': '1928473748',
        '滨海县人民法院': '1939555094',
        '建湖县人民法院': '1941177987',
        '射阳县人民法院': '1935440573',
        '响水县人民法院': '1941138459',
        '盐城经济技术开发区人民法院': '2998148080',
        '江苏省扬州市中级人民法院': '1934787004',
        '扬州市邗江区人民法院': '1947041236',
        '扬州市广陵区人民法院': '1985600613',
        '高邮市人民法院': '1968082607',
        '宝应县人民法院': '1984219521',
        '扬州市江都区人民法院': '1942287877',
        '仪征市人民法院': '1970918500',
        '扬州经济技术开发区人民法院': '2373042534',
        '江苏省镇江市中级人民法院': '1928503318',
        '句容市人民法院': '1942287812',
        '丹阳市人民法院': '1939584527',
        '镇江市润州区人民法院': '1934388861',
        '扬中市人民法院': '1968112294',
        '镇江市京口区人民法院': '1934458038',
        '镇江经济开发区人民法院': '1901684789',
        '镇江市丹徒区人民法院': '1939594925'

    }
    YUNNANCOURT = {
        '云南省高级人民法院': '2636616624',
        '云南省保山市中级人民法院': '2729657796',
        '腾冲市人民法院': '2948006379',
        '昌宁县人民法院': '2706395661',
        '保山市隆阳区人民法院': '2966995661',
        '施甸县人民法院': '3162748150',
        '龙陵县人民法院': '3245738652',
        '云南省楚雄彝族自治州中级人民法院': '2743951139',
        '楚雄市人民法院': '2654645861',
        '姚安县人民法院': '3170045832',
        '元谋县人民法院': '3027294340',
        '武定县人民法院': '2752642153',
        '禄丰县人民法院': '3182091953',
        '永仁县人民法院': '3301427876',
        '双柏县人民法院': '3333158396',
        '南华县人民法院': '2980191067',
        '大姚县人民法院': '3193870626',
        '牟定县人民法院': '3202057778',
        '云南省大理白族自治州中级人民法院': '2691813444',
        '大理市人民法院': '2745682085',
        '鹤庆县人民法院': '2834863591',
        '祥云县人民法院': '2855228488',
        '宾川县人民法院': '2824412271',
        '洱源县人民法院': '2860181072',
        '云龙县人民法院': '2860181063',
        '南涧彝族自治县人民法院': '2850871362',
        '弥渡县人民法院': '2824471709',
        '云南省德宏傣族景颇族自治州中级人民法院': '2885066684',
        '瑞丽市人民法院': '3189592262',
        '芒市人民法院': '3190585614',
        '盈江县人民法院': '3094001241',
        '陇川县人民法院': '3296258720',
        '梁河县人民法院': '3286214158',
        '云南省迪庆藏族自治州中级人民法院': '3071118802',
        '香格里拉市人民法院': '3071089094',
        '红河哈尼族彝族自治州中级人民法院': '2530282023',
        '蒙自市人民法院': '2859952329',
        '个旧市人民法院': '2825136938',
        '泸西县人民法院': '2605331327',
        '弥勒市人民法院': '2782150840',
        '元阳县人民法院': '2809981936',
        '河口瑶族自治县人民法院': '2923228357',
        '石屏县人民法院': '3087242811',
        '开远市人民法院': '2911958846',
        '红河县人民法院': '2769037557',
        '屏边苗族自治县人民法院': '2834834628',
        '建水县人民法院': '2935221281',
        '云南省昆明市中级人民法院': '2559936938',
        '昆明铁路运输中级法院': '2698254868',
        '昆明市西山区人民法院': '2260678100',
        '昆明市盘龙区人民法院': '2644516468',
        '昆明市五华区人民法院': '2630419691',
        '昆明市官渡区人民法院': '2663822850',
        '安宁市人民法院': '2545726836',
        '嵩明县人民法院': '2676554901',
        '石林彝族自治县人民法院': '2647777938',
        '昆明市晋宁区人民法院': '2630409758',
        '禄劝彝族苗族自治县人民法院': '2647538684',
        '富民县人民法院': '2684635526',
        '宜良县人民法院': '2646344011',
        '昆明市呈贡区人民法院': '2647728102',
        '寻甸回族彝族自治县人民法院': '2636576723',
        '昆明市东川区人民法院': '2653123996',
        '云南省临沧市中级人民法院': '2361544650',
        '临沧市临翔区人民法院': '2732785457',
        '双江拉祜族佤族布朗族傣族自治县人民法院': '2923771581',
        '云县人民法院': '2729167549',
        '沧源佤族自治县人民法院': '2729176778',
        '耿马傣族佤族自治县人民法院': '2744751826',
        '永德县人民法院': '2987008239',
        '镇康县人民法院': '2934978046',
        '凤庆县人民法院': '3079971902',
        '华坪县人民法院': '3360451525',
        '永胜县人民法院': '3463956873',
        '玉龙纳西族自治县人民法院': '3350981294',
        '云南省怒江傈僳族自治州中级人民法院': '2706246404',
        '泸水市人民法院': '2698234730',
        '兰坪白族普米族自治县人民法院': '2614173409',
        '云南省普洱市中级人民法院': '2782128610',
        '景东彝族自治县人民法院': '2710587539',
        '普洱市思茅区人民法院': '2645573824',
        '江城哈尼族彝族自治县人民法院': '3083201735',
        '澜沧拉祜族自治县人民法院': '3161890741',
        '墨江哈尼族自治县人民法院': '3162000472',
        '云南省孟连傣族拉祜族佤族自治县人民法院': '2837394558',
        '云南省曲靖市中级人民法院': '2862989220',
        '宣威市人民法院': '2681926676',
        '曲靖市麒麟区人民法院': '2862880966',
        '富源县人民法院': '2834933372',
        '罗平县人民法院': '2706445467',
        '曲靖市沾益区人民法院': '3172783182',
        '陆良县人民法院': '2929056336',
        '师宗县人民法院': '3307253244',
        '会泽县人民法院': '3057915707',
        '云南省文山壮族苗族自治州中级人民法院': '2729637692',
        '马关县人民法院': '2745930854',
        '富宁县人民法院': '2743791866',
        '广南县人民法院': '2750231962',
        '丘北县人民法院': '2754107372',
        '文山市人民法院': '2751723728',
        '西畴县人民法院': '2752532969',
        '云南省西双版纳傣族自治州中级人民法院': '2706504985',
        '勐海县人民法院': '3201366960',
        '景洪市人民法院': '3083292903',
        '勐腊县人民法院': '3087154323',
        '云南省玉溪市中级人民法院': '1717262207',
        '华宁县人民法院': '3375897234',
        '玉溪市红塔区人民法院': '3356912985',
        '易门县人民法院': '3357721857',
        '通海县人民法院': '3357272645',
        '澄江县人民法院': '3364807952',
        '元江哈尼族彝族傣族自治县人民法院': '3355075590',
        '峨山彝族自治县人民法院': '3368075338',
        '新平彝族傣族自治县人民法院': '3387308252',
        '玉溪市江川区人民法院': '3384902780',
        '云南省昭通市中级人民法院': '2776774866',
        '大关县人民法院': '2706276191',
        '镇雄县人民法院': '2640091879',
        '水富县人民法院': '2710672313',
        '永善县人民法院': '3170871845',
        '昭通市昭阳区人民法院': '2831161746',
        '盐津县人民法院': '2959415000',
        '彝良县人民法院': '3258701990',
        '绥江县人民法院': '2698374133'
    }
    HAINANCOURT = {
        '海南省高级人民法院': '2973822583',
        '白沙黎族自治县人民法院': '3021157669',
        '保亭黎族苗族自治县人民法院': '3032025665',
        '澄迈县人民法院': '2995824200',
        '昌江黎族自治县人民法院': '3026372716',
        '海南省第二中级人民法院': '2594886542',
        '儋州市人民法院': '2962793053',
        '海南省洋浦经济开发区人民法院': '3021197283',
        '东方市人民法院': '3022991769',
        '定安县人民法院': '3035065112',
        '海南省第一中级人民法院': '2670296937',
        '海南省海口市中级人民法院': '2967688752',
        '海口市美兰区人民法院': '2997256574',
        '海口市龙华区人民法院': '3026532391',
        '海口海事法院': '2933640760',
        '海口市琼山区人民法院': '3023428298',
        '海口市秀英区人民法院': '3008678565',
        '陵水黎族自治县人民法院': '2867099324',
        '临高县人民法院': '3023388133',
        '乐东黎族自治县人民法院': '3027622138',
        '琼海市人民法院': '2987331111',
        '琼中黎族苗族自治县人民法院': '2987462038',
        '海南省三亚市中级人民法院': '2984939196',
        '三亚市城郊人民法院': '3010537491',
        '屯昌县人民法院': '3119461614',
        '五指山市人民法院': '2829174152',
        '文昌市人民法院': '3257596891',
        '万宁市人民法院': '3405784469'

    }
    GUANGXICOURT = {
        '北海市中级人民法院': '3017382168',
        '北海海事法院': '2430548297',
        '北海市海城区人民法院': '3242936494',
        '北海市银海区人民法院': '3247966210',
        '合浦县人民法院': '3253504237',
        '北海市铁山港区人民法院': '3299788960',
        '广西壮族自治区百色市中级人民法院': '2681206590',
        '百色市右江区人民法院': '2681582989',
        '平果县人民法院': '2682323417',
        '田阳县人民法院': '2680189824',
        '靖西市人民法院': '2681483760',
        '德保县人民法院': '2680312255',
        '田东县人民法院': '2680390686',
        '田林县人民法院': '2683522984',
        '西林县人民法院': '2681473865',
        '乐业县人民法院': '2683240248',
        '隆林各族自治县人民法院': '2694982011',
        '那坡县人民法院': '2680420504',
        '凌云县人民法院': '2683200636',
        '广西壮族自治区崇左市中级人民法院': '2986147054',
        '宁明县人民法院': '3169995983',
        '扶绥县人民法院': '3171694535',
        '凭祥市人民法院': '3029156286',
        '龙州县人民法院': '2959294989',
        '大新县人民法院': '2968558542',
        '崇左市江州区人民法院': '3170135527',
        '天等县人民法院': '3075571075',
        '广西壮族自治区防城港市中级人民法院': '3169926164',
        '防城港市港口区人民法院': '3080061879',
        '东兴市人民法院': '3171080800',
        '上思县人民法院': '3175031779',
        '防城港市防城区人民法院': '3064721567',
        '桂林市中级人民法院': '3207945566',
        '平乐县人民法院': '3192650035',
        '桂林市象山区人民法院': '3042469367',
        '桂林市七星区人民法院': '3208124006',
        '灌阳县人民法院': '3202236130',
        '荔浦县人民法院': '3188848863',
        '桂林市叠彩区人民法院': '3191978128',
        '全州县人民法院': '3192147548',
        '桂林市秀峰区人民法院': '3192152019',
        '兴安县人民法院': '3192504123',
        '桂林市临桂区人民法院': '3179934533',
        '灵川县人民法院': '3190942825',
        '阳朔县人民法院': '3201911112',
        '龙胜各族自治县人民法院': '3175071720',
        '桂林市雁山区人民法院': '3191740645',
        '资源县人民法院': '3182825709',
        '永福县人民法院': '3181961185',
        '恭城瑶族自治县人民法院': '3191850003',
        '广西壮族自治区贵港市中级人民法院': '3109486714',
        '贵港市港北区人民法院': '3171959265',
        '桂平市人民法院': '3182164034',
        '平南县人民法院': '3216938648',
        '贵港市覃塘区人民法院': '3182815826',
        '贵港市港南区人民法院': '3217391101',
        '广西壮族自治区贺州市中级人民法院': '3161841273',
        '昭平县人民法院': '2554950136',
        '贺州市八步区人民法院': '2967970992',
        '钟山县人民法院': '3002192163',
        '富川瑶族自治县人民法院': '3000336262',
        '广西壮族自治区河池市中级人民法院': '3248631849',
        '河池市金城江区人民法院': '3249453978',
        '宜州市人民法院': '3249404145',
        '凤山县人民法院': '3249234915',
        '大化瑶族自治县人民法院': '3249400011',
        '都安瑶族自治县人民法院': '3249280434',
        '环江毛南族自治县人民法院': '3249260470',
        '罗城仫佬族自治县人民法院': '3247787967',
        '天峨县人民法院': '3228496583',
        '巴马瑶族自治县人民法院': '3248941179',
        '南丹县人民法院': '3253093833',
        '东兰县人民法院': '3256553186',
        '广西壮族自治区来宾市中级人民法院': '3221245548',
        '合山市人民法院': '3256443622',
        '来宾市兴宾区人民法院': '3247668308',
        '象州县人民法院': '3253573868',
        '武宣县人民法院': '3255829370',
        '忻城县人民法院': '3299562232',
        '广西壮族自治区柳州市中级人民法院': '3249300305',
        '柳州市柳南区人民法院': '3247668334',
        '柳州市柳江区人民法院': '3251382145',
        '柳州市城中区人民法院': '3249194826',
        '柳州市鱼峰区人民法院': '3249160539',
        '融安县人民法院': '3249109574',
        '柳州市柳北区人民法院': '3251372122',
        '鹿寨县人民法院': '3249380049',
        '融水苗族自治县人民法院': '3249150697',
        '三江侗族自治县人民法院': '3248037678',
        '柳城县人民法院': '3249390022',
        '柳州铁路运输法院': '3251466367',
        '广西壮族自治区南宁市中级人民法院': '3246253080',
        '南宁铁路运输中级法院': '3242582555',
        '广西壮族自治区高级人民法院': '3294959619',
        '南宁市青秀区人民法院': '2901633481',
        '南宁市江南区人民法院': '2750231971',
        '宾阳县人民法院': '3027482699',
        '南宁市武鸣区人民法院': '3171897626',
        '南宁市兴宁区人民法院': '3014883780',
        '南宁市西乡塘区人民法院': '2980985706',
        '横县人民法院': '3074159370',
        '南宁市良庆区人民法院': '3107829612',
        '上林县人民法院': '3027582520',
        '南宁市邕宁区人民法院': '2560465686',
        '马山县人民法院': '3175645864',
        '隆安县人民法院': '3081765029',
        '南宁铁路运输法院': '3249194997',
        '广西壮族自治区钦州市中级人民法院': '2950638570',
        '浦北县人民法院': '2948652325',
        '钦州市钦北区人民法院': '2912128388',
        '钦州市钦南区人民法院': '2890922074',
        '灵山县人民法院': '2945798424',
        '广西壮族自治区梧州市中级人民法院': '3262080828',
        '岑溪市人民法院': '3251461418',
        '梧州市龙圩区人民法院': '3286450848',
        '梧州市万秀区人民法院': '3280725112',
        '梧州市长洲区人民法院': '3257686200',
        '蒙山县人民法院': '3193115685',
        '藤县人民法院': '3246233354',
        '苍梧县人民法院': '3252065528',
        '广西壮族自治区玉林市中级人民法院': '3077582525',
        '玉林市玉州区人民法院': '3166884437',
        '容县人民法院': '3161343563',
        '北流市人民法院': '3179673816',
        '玉林市福绵区人民法院': '3070415675',
        '博白县人民法院': '3171642974',
        '兴业县人民法院': '3170899897',
        '陆川县人民法院': '3166711564'
    }
    SICHUANCOURT = {
        '成都铁路运输中级法院': '2542995783',
        '成都铁路运输法院': '3086428305',
        '四川省阿坝藏族羌族自治州中级人民法院': '2923099992',
        '小金县人民法院': '2932527946',
        '金川县人民法院': '3051678288',
        '汶川县人民法院': '3064966759',
        '红原县人民法院': '2934997772',
        '茂县人民法院': '2943780513',
        '九寨沟县人民法院': '3043120648',
        '四川省巴中市中级人民法院': '2194790487',
        '巴中市巴州区人民法院': '2226983582',
        '平昌县人民法院': '2277880260',
        '南江县人民法院': '2293905994',
        '巴中市恩阳区人民法院': '2324667543',
        '通江县人民法院': '2355622012',
        '四川省成都市中级人民法院': '2825285724',
        '成都高新技术产业开发区人民法院': '2829282839',
        '成都市武侯区人民法院': '2825375215',
        '成都市郫都区人民法院': '2829501656',
        '成都市金牛区人民法院': '2834834632',
        '邛崃市人民法院': '2825345104',
        '成都市温江区人民法院': '2901366395',
        '简阳市人民法院': '2849597771',
        '成都市双流区人民法院': '2825216068',
        '成都市锦江区人民法院': '2829243234',
        '成都市青羊区人民法院': '2825265674',
        '成都市青白江区人民法院': '2825345083',
        '成都市新都区人民法院': '2825156613',
        '都江堰市人民法院': '2829312622',
        '成都市龙泉驿区人民法院': '2861395350',
        '金堂县人民法院': '2829223401',
        '蒲江县人民法院': '2825195910',
        '彭州市人民法院': '2825404994',
        '新津县人民法院': '2825464798',
        '成都市成华区人民法院': '2829193690',
        '崇州市人民法院': '2829571554',
        '大邑县人民法院': '2829233217',
        '四川省达州市中级人民法院': '2874198564',
        '达州市达川区人民法院': '2883262993',
        '达州市通川区人民法院': '2885039296',
        '渠县人民法院': '2874421425',
        '宣汉县人民法院': '2873726434',
        '大竹县人民法院': '2873509476',
        '万源市人民法院': '2880151631',
        '开江县人民法院': '2879316776',
        '四川省德阳市中级人民法院': '2916642121',
        '德阳市旌阳区人民法院': '2916602377',
        '绵竹市人民法院': '2918089902',
        '罗江县人民法院': '2923269988',
        '什邡市人民法院': '2912470513',
        '广汉市人民法院': '2914519099',
        '中江县人民法院': '2912337959',
        '四川省广安市中级人民法院': '2691783482',
        '华蓥市人民法院': '2829601455',
        '岳池县人民法院': '2780768974',
        '广安市前锋区人民法院': '2364623017',
        '武胜县人民法院': '2534255158',
        '邻水县人民法院': '2780990103',
        '广安市广安区人民法院': '2874188520',
        '甘孜藏族自治州中级人民法院': '2874600075',
        '泸定县人民法院': '2878062406',
        '乡城县人民法院': '2966536996',
        '稻城县人民法院': '2926625795',
        '丹巴县人民法院': '2653242689',
        '雅江县人民法院': '2934968186',
        '九龙县人民法院': '2943545852',
        '康定市人民法院': '2950598602',
        '道孚县人民法院': '2950688558',
        '广元市利州区人民法院': '3356605355',
        '青川县人民法院': '3432538086',
        '四川省泸州市中级人民法院': '2591260590',
        '泸州市龙马潭区人民法院': '2664011336',
        '泸县人民法院': '2663942065',
        '合江县人民法院': '2663674603',
        '泸州市江阳区人民法院': '2670445554',
        '叙永县人民法院': '2663773667',
        '泸州市纳溪区人民法院': '2664001268',
        '古蔺县人民法院': '2663803010',
        '四川省乐山市中级人民法院': '2918530430',
        '乐山市市中区人民法院': '2912480479',
        '乐山市五通桥区人民法院': '2922371572',
        '犍为县人民法院': '2917494601',
        '井研县人民法院': '2919444672',
        '乐山市金口河区人民法院': '2918710837',
        '马边彝族自治县人民法院': '2917315668',
        '乐山市沙湾区人民法院': '2921430719',
        '峨边彝族自治县人民法院': '2921561891',
        '四川省凉山彝族自治州中级人民法院': '2923809881',
        '西昌市人民法院': '2933373537',
        '冕宁县人民法院': '3002062805',
        '西昌铁路运输法院': '3393295406',
        '四川省绵阳市中级人民法院': '2907551509',
        '江油市人民法院': '2968528709',
        '绵阳市安州区人民法院': '2525436270',
        '三台县人民法院': '2916452677',
        '绵阳市涪城区人民法院': '2939317631',
        '绵阳高新技术产业开发区人民法院': '2921691472',
        '绵阳市游仙区人民法院': '2914244437',
        '平武县人民法院': '2398712580',
        '北川羌族自治县人民法院': '2259909137',
        '盐亭县人民法院': '2950438775',
        '梓潼县人民法院': '2939117931',
        '四川省南充市中级人民法院': '2909201212',
        '南部县人民法院': '2923209926',
        '南充市顺庆区人民法院': '2923600169',
        '仪陇县人民法院': '2458939561',
        '南充市嘉陵区人民法院': '2919444692',
        '营山县人民法院': '2922140230',
        '蓬安县人民法院': '2916602373',
        '阆中市人民法院': '2923279820',
        '西充县人民法院': '2691942941',
        '南充市高坪区人民法院': '2916761014',
        '四川省内江市中级人民法院': '2866219863',
        '威远县人民法院': '2906710532',
        '隆昌县人民法院': '2933684428',
        '资中县人民法院': '2894327994',
        '内江市市中区人民法院': '2943427266',
        '内江市东兴区人民法院': '2923560337',
        '四川省攀枝花市中级人民法院': '2502287417',
        '攀枝花市东区人民法院': '2939225686',
        '攀枝花市西区人民法院': '2937612214',
        '攀枝花市仁和区人民法院': '2706425595',
        '米易县人民法院': '2957311095',
        '盐边县人民法院': '2957840386',
        '四川省遂宁市中级人民法院': '2935117469',
        '射洪县人民法院': '2847803261',
        '遂宁市船山区人民法院': '2975268943',
        '蓬溪县人民法院': '2928135100',
        '大英县人民法院': '2962822989',
        '遂宁市安居区人民法院': '2907114713',
        '四川省宜宾市中级人民法院': '2939018423',
        '屏山县人民法院': '2208087218',
        '江安县人民法院': '2878052865',
        '宜宾市南溪区人民法院': '2880672653',
        '宜宾市翠屏区人民法院': '2885089231',
        '宜宾县人民法院': '2906918769',
        '珙县人民法院': '2923916020',
        '长宁县人民法院': '2222982627',
        '筠连县人民法院': '2907760709',
        '高县人民法院': '2904740221',
        '兴文县人民法院': '2923769695',
        '四川省雅安市中级人民法院': '2959532201',
        '石棉县人民法院': '2961716493',
        '汉源县人民法院': '2959392519',
        '雅安市名山区人民法院': '2959272517',
        '荥经县人民法院': '2959492244',
        '雅安市雨城区人民法院': '2959252485',
        '天全县人民法院': '2961756479',
        '芦山县人民法院': '2961646630',
        '自贡市大安区人民法院': '2979456850',
        '富顺县人民法院': '2979713885',
        '自贡市自流井区人民法院': '2985177773',
        '荣县人民法院': '2990491147',
        '四川省资阳市中级人民法院': '3327661975',
        '乐至县人民法院': '3295925084',
        '资阳市雁江区人民法院': '3356221063'
    }
    GUIZHOUCOURT = {
        '贵州省高级人民法院': '2313707153',
        '贵阳铁路运输法院': '2335995453',
        '贵州省安顺市中级人民法院': '2315294531',
        '安顺市平坝区人民法院': '2335784834',
        '安顺市西秀区人民法院': '2327689653',
        '镇宁布依族苗族自治县人民法院': '2327235284',
        '普定县人民法院': '2327779294',
        '关岭布依族苗族自治县人民法院': '2320382612',
        '紫云苗族布依族自治县人民法院': '2327215443',
        '贵州省毕节市中级人民法院': '2318778712',
        '毕节市七星关区人民法院': '2343778722',
        '黔西县人民法院': '2351746479',
        '织金县人民法院': '2337424196',
        '金沙县人民法院': '2327858966',
        '大方县人民法院': '2343908382',
        '纳雍县人民法院': '2337274497',
        '贵州省威宁彝族回族苗族自治县人民法院': '2337234660',
        '赫章县人民法院': '2343558787',
        '贵州省贵阳市中级人民法院': '2346255357',
        '贵阳市南明区人民法院': '2337384273',
        '贵阳市云岩区人民法院': '2335745005',
        '贵阳市花溪区人民法院': '2346365037',
        '贵阳市观山湖区人民法院': '2335939147',
        '清镇市人民法院': '2346285203',
        '贵阳市白云区人民法院': '2346175543',
        '贵阳市乌当区人民法院': '2346205458',
        '息烽县人民法院': '2361627868',
        '修文县人民法院': '2346025764',
        '开阳县人民法院': '2347892545',
        '贵州省六盘水市中级人民法院': '2335849677',
        '六盘水市钟山区人民法院': '2346325223',
        '盘县人民法院': '2347992373',
        '六盘水市六枝特区人民法院': '2346355003',
        '水城县人民法院': '2347653233',
        '贵州省黔南布依族苗族自治州中级人民法院': '2299505895',
        '都匀市人民法院': '2310156299',
        '福泉市人民法院': '2315144617',
        '瓮安县人民法院': '2315124906',
        '贵定县人民法院': '2348771158',
        '龙里县人民法院': '2335804988',
        '三都水族自治县人民法院': '2346185401',
        '荔波县人民法院': '2346285187',
        '独山县人民法院': '2318549187',
        '惠水县人民法院': '2347803029',
        '长顺县人民法院': '2348621647',
        '罗甸县人民法院': '2343758492',
        '平塘县人民法院': '2351666735',
        '贵州省黔东南苗族侗族自治州中级人民法院': '2335705114',
        '凯里市人民法院': '2327928901',
        '榕江县人民法院': '2347792925',
        '丹寨县人民法院': '2324697591',
        '台江县人民法院': '2356452318',
        '黄平县人民法院': '2360680830',
        '锦屏县人民法院': '2347852746',
        '天柱县人民法院': '2348880802',
        '从江县人民法院': '2343848474',
        '剑河县人民法院': '2360697088',
        '岑巩县人民法院': '2347743063',
        '麻江县人民法院': '2352433515',
        '镇远县人民法院': '2353201553',
        '雷山县人民法院': '2347892544',
        '三穗县人民法院': '2347803028',
        '黎平县人民法院': '2347743064',
        '黔西南布依族苗族自治州中级人民法院': '2337145453',
        '册亨县人民法院': '2327759387',
        '安龙县人民法院': '2422130502',
        '兴义市人民法院': '2374097272',
        '贞丰县人民法院': '2346045675',
        '普安县人民法院': '2347673200',
        '兴仁县人民法院': '2384738963',
        '晴隆县人民法院': '2346275161',
        '望谟县人民法院': '2361205858',
        '贵州省铜仁市中级人民法院': '2320359641',
        '铜仁市碧江区人民法院': '2335595966',
        '思南县人民法院': '2335934390',
        '松桃苗族自治县人民法院': '2320041784',
        '江口县人民法院': '2335645403',
        '玉屏侗族自治县人民法院': '2345965963',
        '石阡县人民法院': '2361165920',
        '德江县人民法院': '2327235263',
        '沿河土家族自治县人民法院': '2347942500',
        '印江土家族苗族自治县人民法院': '2345212250',
        '铜仁市万山区人民法院': '2346245314',
        '遵义市中级人民法院': '2298174591',
        '遵义市红花岗区人民法院': '2269986385',
        '遵义市汇川区人民法院': '2270154973',
        '桐梓县人民法院': '2260038936',
        '赤水市人民法院': '2260957213',
        '遵义市播州区人民法院': '2260158440',
        '仁怀市人民法院': '2260947433',
        '湄潭县人民法院': '2260837709',
        '凤冈县人民法院': '2260777946',
        '习水县人民法院': '2270016215',
        '余庆县人民法院': '2269888170',
        '务川仡佬族苗族自治县人民法院': '2260598571',
        '正安县人民法院': '2260028851',
        '绥阳县人民法院': '2259989059',
        '道真仡佬族苗族自治县人民法院': '2260540131'
    }
    NINGXIACOURT = {
        '宁夏回族自治区固原市中级人民法院': '3174838605',
        '固原市原州区人民法院': '3175202903',
        '西吉县人民法院': '3182001168',
        '隆德县人民法院': '3175718837',
        '石嘴山市中级人民法院': '3176040718',
        '石嘴山市大武口区人民法院': '3175638909',
        '石嘴山市惠农区人民法院': '3172669560',
        '宁夏回族自治区吴忠市中级人民法院': '3174934379',
        '吴忠市利通区人民法院': '3172730835',
        '青铜峡市人民法院': '3189334739',
        '宁夏回族自治区银川市中级人民法院': '2543245067',
        '宁夏回族自治区高级人民法院': '3172952266',
        '银川市兴庆区人民法院': '2469066502',
        '银川市金凤区人民法院': '3175141535',
        '灵武市人民法院': '3175183691',
        '银川市西夏区人民法院': '3172977067',
        '贺兰县人民法院': '3179933550',
        '永宁县人民法院': '3174927069',
        '宁夏回族自治区中卫市中级人民法院': '3172038963',
        '中卫市沙坡头区人民法院': '3174966963',
        '中宁县人民法院': '3174838634'
    }
    QINGHAICOURT = {
        '青海省高级人民法院': '3016433945',
        '海北藏族自治州中级人民法院': '3020946606',
        '门源回族自治县人民法院': '3021235567',
        '海晏县人民法院': '3020926867',
        '青海省海东市中级人民法院': '3016414120',
        '互助土族自治县人民法院': '3016040938',
        '海东市乐都区人民法院': '3016543584',
        '民和回族土族自治县人民法院': '3016030902',
        '海东市平安区人民法院': '3016344080',
        '黄南藏族自治州中级人民法院': '3016240127',
        '尖扎县人民法院': '3016040927',
        '海南藏族自治州中级人民法院': '3016553588',
        '共和县人民法院': '3016384339',
        '海西州中级人民法院': '3021035031',
        '大柴旦矿区人民法院': '3021185806',
        '格尔木市人民法院': '3021036427',
        '德令哈市人民法院': '3020925550',
        '乌兰县人民法院': '3021116029',
        '青海省西宁市中级人民法院': '3017319944',
        '湟中县人民法院': '3017799160',
        '西宁市城西区人民法院': '3016288459',
        '西宁市城中区人民法院': '3017880423',
        '西宁市城北区人民法院': '3017619903',
        '西宁市城东区人民法院': '3016160638',
        '湟源县人民法院': '3015743719',
        '大通回族土族自治县人民法院': '3017968780',
        '玉树藏族自治州中级人民法院': '3016040916'

    }
    LIAONINGCOURT = {
        '辽宁省朝阳市中级人民法院': '3174964258',
        '大连市沙河口区人民法院': '3278087557',
        '庄河市人民法院': '3256682155',
        '大连市西岗区人民法院': '3256443660',
        '瓦房店市人民法院': '3256583045',
        '大连海事法院': '3371073130',
        '大连市旅顺口区人民法院': '3257526941',
        '辽宁省抚顺市中级人民法院': '3208630839',
        '抚顺市望花区人民法院': '3191958669',
        '抚顺市东洲区人民法院': '3182200519',
        '抚顺县人民法院': '2629030186',
        '抚顺市顺城区人民法院': '3175840054',
        '抚顺市新抚区人民法院': '3241947820',
        '新宾满族自治县人民法院': '3182110674',
        '清原满族自治县人民法院': '3217341654',
        '辽宁省阜新市中级人民法院': '3182141861',
        '彰武县人民法院': '3230078959',
        '阜新市海州区人民法院': '3189175785',
        '阜新市太平区人民法院': '3191905320',
        '阜新市细河区人民法院': '3199672434',
        '阜新市清河门区人民法院': '3177447479',
        '阜新市新邱区人民法院': '3175840039',
        '辽宁省葫芦岛市中级人民法院': '3175795334',
        '兴城市人民法院': '3264193267',
        '辽阳市中级人民法院': '3180021180',
        '辽阳市太子河区人民法院': '3190535735',
        '辽阳市宏伟区人民法院': '3179864817',
        '辽宁省沈阳市中级人民法院': '3178552907',
        '沈阳市和平区人民法院': '3157511264',
        '沈阳市皇姑区人民法院': '3182081944',
        '沈阳市沈河区人民法院': '3192640559',
        '沈阳市沈北新区人民法院': '3231759650',
        '新民市人民法院': '3199822119',
        '法库县人民法院': '2918640202',
        '沈阳市于洪区人民法院': '3204050688',
        '沈阳市铁西区人民法院': '3192217174',
        '沈阳市大东区人民法院': '3188928996',
        '沈阳市辽中区人民法院': '3172822862',
        '辽宁省营口市中级人民法院': '3191621117',
        '盖州市人民法院': '3192134807',
        '营口市西市区人民法院': '3193605938'
    }
    JILINCOURT = {
        '吉林省白城市中级人民法院': '2605321780',
        '通榆县人民法院': '2605092695',
        '白城市洮北区人民法院': '2606275313',
        '镇赉县人民法院': '2605431512',
        '洮南市人民法院': '2605142194',
        '大安市人民法院': '2605112722',
        '吉林省白山市中级人民法院': '2605117655',
        '长白朝鲜族自治县人民法院': '2605376436',
        '抚松县人民法院': '2605356502',
        '白山市江源区人民法院': '2605356501',
        '临江市人民法院': '2605897296',
        '白山市浑江区人民法院': '2606046225',
        '靖宇县人民法院': '2605156867',
        '抚松林区基层法院': '2605156869',
        '吉林省吉林市中级人民法院': '2087297445',
        '吉林市船营区人民法院': '2657552434',
        '磐石市人民法院': '2654784787',
        '桦甸市人民法院': '2653322558',
        '吉林高新技术产业开发区人民法院': '2695091464',
        '吉林市昌邑区人民法院': '2653134336',
        '吉林市丰满区人民法院': '2653686934',
        '舒兰市人民法院': '2653183029',
        '吉林市龙潭区人民法院': '2653202749',
        '永吉县人民法院': '2658133050',
        '蛟河市人民法院': '2671064216',
        '吉林铁路运输法院': '2605097432',
        '吉林省辽源市中级人民法院': '2152763143',
        '辽源市龙山区人民法院': '2494234246',
        '东丰县人民法院': '2486395364',
        '东辽县人民法院': '2500862663',
        '辽源市西安区人民法院': '2492943048',
        '吉林省四平市中级人民法院': '2605361715',
        '四平市铁西区人民法院': '2606006515',
        '四平市铁东区人民法院': '2605172161',
        '伊通满族自治县人民法院': '2605271891',
        '双辽市人民法院': '2605251900',
        '梨树县人民法院': '2605132366',
        '公主岭市人民法院': '2605451421',
        '松原市中级人民法院': '2605326501',
        '松原市宁江区人民法院': '2605166889',
        '前郭尔罗斯蒙古族自治县人民法院': '2606056105',
        '长岭县人民法院': '2605166891',
        '扶余市人民法院': '2605072940',
        '乾安县人民法院': '2605137119',
        '吉林省通化市中级人民法院': '2605102629',
        '梅河口市人民法院': '2605062966',
        '通化市东昌区人民法院': '2605172160',
        '柳河县人民法院': '2606285458',
        '辉南县人民法院': '2216022251',
        '通化县人民法院': '2605271890',
        '通化市二道江区人民法院': '2605411614',
        '集安市人民法院': '2605986269',
        '延边朝鲜族自治州中级人民法院': '2605451422',
        '吉林省延边林区中级法院': '2606255632',
        '延吉市人民法院': '2525326855',
        '珲春市人民法院': '2605431511',
        '安图县人民法院': '2605321781',
        '敦化市人民法院': '2605461195',
        '龙井市人民法院': '2605416476',
        '和龙市人民法院': '2605132369',
        '汪清县人民法院': '2605371664',
        '图们市人民法院': '2606176130',
        '白河林区基层法院': '2605246657',
        '汪清林区基层法院': '2605156872',
        '敦化林区基层法院': '2605376437',
        '和龙林区基层法院': '2605236619',
        '珲春林区基层法院': '2606026251',
        '吉林省长春市中级人民法院': '2575447934',
        '长春高新技术产业开发区人民法院': '2605281841',
        '长春市南关区人民法院': '2573914068',
        '长春市朝阳区人民法院': '2584902296',
        '德惠市人民法院': '2557559669',
        '榆树市人民法院': '2581767067',
        '长春经济技术开发区人民法院': '2559867095',
        '长春市宽城区人民法院': '2594796440',
        '长春市二道区人民法院': '2587590335',
        '长春净月高新技术产业开发区人民法院': '2555305673',
        '农安县人民法院': '2584912362',
        '长春市绿园区人民法院': '2563431764',
        '九台市人民法院': '2581996692',
        '长春市双阳区人民法院': '2587620174',
        '长春汽车经济技术开发区人民法院': '2593737563'

    }
    HEILONGJIANGCOURT = {
        '黑龙江省高级人民法院': '2738456122',
        '黑龙江省大庆市中级人民法院': '2662336578',
        '大庆高新技术产业开发区人民法院': '2658799670',
        '肇源县人民法院': '2659076790',
        '大庆市让胡路区人民法院': '2658918581',
        '大庆市萨尔图区人民法院': '2658898876',
        '林甸县人民法院': '2659086942',
        '大庆市龙凤区人民法院': '2658829261',
        '大庆市大同区人民法院': '2658918610',
        '肇州县人民法院': '2659017302',
        '大庆市红岗区人民法院': '2658819396',
        '杜尔伯特蒙古族自治县人民法院': '2662237348',
        '黑龙江省大兴安岭地区中级人民法院': '2780042005',
        '大兴安岭地区加格达奇区人民法院': '2780201684',
        '漠河县人民法院': '2780241463',
        '黑龙江省哈尔滨市中级人民法院': '2788123263',
        '黑龙江省农垦中级法院': '2904481259',
        '黑龙江省林区中级人民法院': '2780002119',
        '宾县人民法院': '2807673218',
        '巴彦县人民法院': '2780022037',
        '哈尔滨市道外区人民法院': '2780193273',
        '哈尔滨市香坊区人民法院': '2786778372',
        '双城市人民法院': '2780261218',
        '哈尔滨市阿城区人民法院': '2779932540',
        '哈尔滨市呼兰区人民法院': '2776774891',
        '方正县人民法院': '2777024526',
        '哈尔滨市南岗区人民法院': '2780300997',
        '五常市人民法院': '2780022038',
        '延寿县人民法院': '2780237313',
        '哈尔滨市道里区人民法院': '2780241460',
        '通河县人民法院': '2780271193',
        '尚志市人民法院': '2780051889',
        '木兰县人民法院': '2779932539',
        '依兰县人民法院': '2779962385',
        '哈尔滨市平房区人民法院': '2782210517',
        '哈尔滨市松北区人民法院': '2780820900',
        '兴隆林区基层法院': '2786987446',
        '苇河林区基层法院': '2780679857',
        '亚布力林区基层法院': '2780990029',
        '黑龙江省鹤岗市中级人民法院': '2885136607',
        '鹤岗市工农区人民法院': '3021156062',
        '黑龙江省宝泉岭农垦法院': '2776804999',
        '鹤岗市向阳区人民法院': '3031986219',
        '萝北县人民法院': '3077622414',
        '鹤岗市兴安区人民法院': '3108141949',
        '鹤岗市东山区人民法院': '3112306431',
        '鹤岗市南山区人民法院': '3044809685',
        '绥滨县人民法院': '3322500580',
        '黑河市中级人民法院': '2861245413',
        '北安市人民法院': '2990501195',
        '黑河市爱辉区人民法院': '2990722024',
        '五大连池市人民法院': '2991023006',
        '孙吴县人民法院': '2996763588',
        '逊克县人民法院': '3017589691',
        '沾河林区基层法院': '2824262461',
        '嫩江县人民法院': '2996972229',
        '黑龙江省佳木斯市中级人民法院': '2810271883',
        '佳木斯市东风区人民法院': '2824242583',
        '同江市人民法院': '2811152125',
        '佳木斯铁路运输法院': '3256056610',
        '佳木斯市向阳区人民法院': '2810983818',
        '佳木斯市郊区人民法院': '2811251232',
        '汤原县人民法院': '2837720119',
        '佳木斯市前进区人民法院': '2825236031',
        '桦南县人民法院': '2815084032',
        '抚远县人民法院': '2780281227',
        '富锦市人民法院': '3357332534',
        '黑龙江省建三江农垦法院': '3333168005',
        '黑龙江省鹤立林区基层法院': '2779934047',
        '桦川县人民法院': '2811112296',
        '黑龙江省鸡西市中级人民法院': '2810943863',
        '鸡西市鸡冠区人民法院': '2975499984',
        '密山市人民法院': '2985037986',
        '鸡东县人民法院': '3327572593',
        '虎林市人民法院': '3326502547',
        '鸡西市梨树区人民法院': '3321810926',
        '鸡西市滴道区人民法院': '3334607247',
        '黑龙江省牡丹江农垦法院': '2780599655',
        '东方红林区基层法院': '3258695138',
        '鸡西市恒山区人民法院': '3334391091',
        '鸡西市麻山区人民法院': '3335085801',
        '黑龙江省牡丹江市中级人民法院': '2786168033',
        '牡丹江市东安区人民法院': '2810451243',
        '东宁市人民法院': '2807722840',
        '穆棱市人民法院': '2809832794',
        '绥芬河市人民法院': '2780310923',
        '宁安市人民法院': '2786888132',
        '林口县人民法院': '2809902439',
        '牡丹江市阳明区人民法院': '2786058674',
        '牡丹江市西安区人民法院': '2788501992',
        '海林市人民法院': '2807603703',
        '牡丹江市爱民区人民法院': '2786038737',
        '穆棱林区基层法院': '2781909919',
        '黑龙江省齐齐哈尔市中级人民法院': '2780012128',
        '齐齐哈尔市龙沙区人民法院': '2779902754',
        '讷河市人民法院': '2776754861',
        '甘南县人民法院': '2776675903',
        '克东县人民法院': '2776695163',
        '齐齐哈尔市梅里斯达斡尔族区人民法院': '3191168586',
        '齐齐哈尔市铁锋区人民法院': '2777023987',
        '齐齐哈尔市富拉尔基区人民法院': '2780291148',
        '克山县人民法院': '2779882869',
        '富裕县人民法院': '2776904888',
        '龙江县人民法院': '2777004176',
        '依安县人民法院': '2776884993',
        '泰来县人民法院': '2776714956',
        '齐齐哈尔市昂昂溪区人民法院': '2780141788',
        '拜泉县人民法院': '2776834637',
        '齐齐哈尔市建华区人民法院': '2780131810',
        '齐齐哈尔市碾子山区人民法院': '2776815287',
        '齐齐哈尔农垦法院': '2776765412',
        '黑龙江省七台河市中级人民法院': '2824441721',
        '七台河市新兴区人民法院': '3241888026',
        '七台河市桃山区人民法院': '3341850863',
        '七台河市茄子河区人民法院': '3336079384',
        '黑龙江省双鸭山市中级人民法院': '2780031964',
        '宝清县人民法院': '2779948259',
        '黑龙江省红兴隆农垦法院': '2780061961',
        '友谊县人民法院': '2780101803',
        '双鸭山市尖山区人民法院': '2779992199',
        '双鸭山市四方台区人民法院': '2780071937',
        '双鸭山市岭东区人民法院': '2780071939',
        '双鸭山市宝山区人民法院': '2780261219',
        '饶河县人民法院': '2779992197',
        '集贤县人民法院': '2780310918',
        '黑龙江省绥化市中级人民法院': '2779968673',
        '安达市人民法院': '2780286916',
        '肇东市人民法院': '3083251460',
        '绥化市北林区人民法院': '2779902757',
        '青冈县人民法院': '2780121729',
        '望奎县人民法院': '2780181660',
        '庆安县人民法院': '2779882871',
        '海伦市人民法院': '2780042009',
        '兰西县人民法院': '2779934039',
        '明水县人民法院': '3218650725',
        '绥棱县人民法院': '2785929385',
        '黑龙江省绥化农垦法院': '3165182321',
        '黑龙江省伊春市中级人民法院': '2824521477',
        '伊春市乌伊岭区人民法院': '2759559041',
        '铁力市人民法院': '2860139054',
        '伊春市乌马河区人民法院': '2879982769',
        '伊春市南岔区人民法院': '3010587486',
        '铁力林区基层法院': '3170115952',
        '朗乡林区基层法院': '2824461695',
        '嘉荫县人民法院': '2860220910',
        '伊春市伊春区人民法院': '3094190064',
        '伊春市翠峦区人民法院': '2824491474',
        '伊春市汤旺河区人民法院': '2824372230'
    }
    XIZANGCOURT = {
        '西藏阿里地区中级人民法院': '3192668618',
        '林芝市巴宜区人民法院': '3204140240',
        '西藏拉萨市中级人民法院': '3216513808',
        '拉萨市城关区人民法院': '3339784835'
    }
    GANSUCOURT = {
        '甘肃省高级人民法院': '3166764991',
        '甘肃省白银市中级人民法院': '3165142327',
        '景泰县人民法院': '3165112399',
        '白银市白银区人民法院': '3165314213',
        '白银市平川区人民法院': '3166771348',
        '靖远县人民法院': '3165341854',
        '甘肃省定西市中级人民法院': '3172536613',
        '临洮县人民法院': '2873806203',
        '通渭县人民法院': '3170911525',
        '定西市安定区人民法院': '3165600056',
        '岷县人民法院': '3170841883',
        '卓尼县人民法院': '3172038975',
        '临潭县人民法院': '3178443462',
        '甘肃省嘉峪关市中级人民法院': '3178194563',
        '嘉峪关市城区人民法院': '3175861701',
        '甘肃矿区人民法院': '2921390977',
        '甘肃省金昌市中级人民法院': '3343082679',
        '永昌县人民法院': '3165154482',
        '金昌市金川区人民法院': '3165254331',
        '甘肃省酒泉市中级人民法院': '3165147647',
        '玉门市人民法院': '3175587432',
        '瓜州县人民法院': '3165137511',
        '金塔县人民法院': '3165327270',
        '酒泉市肃州区人民法院': '3165347152',
        '甘肃省肃北蒙古族自治县人民法院': '3165510275',
        '敦煌市人民法院': '3166761510',
        '甘肃省兰州市中级人民法院': '2257080521',
        '甘肃省林区中级法院': '3230325234',
        '兰州铁路运输中级法院': '3175725613',
        '兰州市七里河区人民法院': '3171957426',
        '兰州市城关区人民法院': '3191181383',
        '榆中县人民法院': '3165420574',
        '兰州市安宁区人民法院': '3165430089',
        '兰州新区人民法院': '3165254341',
        '永登县人民法院': '3166774524',
        '兰州市西固区人民法院': '3172478155',
        '兰州市红古区人民法院': '3175787273',
        '陇南市中级人民法院': '3165510262',
        '陇南市武都区人民法院': '3165319918',
        '临夏回族自治州中级人民法院': '3175665951',
        '永靖县人民法院': '3178264313',
        '和政县人民法院': '3175506681',
        '东乡族自治县人民法院': '3249210604',
        '康乐县人民法院': '3172658844',
        '临夏县人民法院': '3172676582',
        '积石山保安族东乡族撒拉族自治县人民法院': '3175569604',
        '甘肃省平凉市中级人民法院': '3171927694',
        '泾川县人民法院': '3166764965',
        '灵台县人民法院': '3166844601',
        '平凉市崆峒区人民法院': '3166791339',
        '甘肃省庆阳市中级人民法院': '2533800107',
        '庆阳市西峰区人民法院': '3175529683',
        '合水县人民法院': '3191830246',
        '宁县人民法院': '3180260716',
        '庆城县人民法院': '3189592261',
        '正宁县人民法院': '3179832842',
        '庆阳林区基层法院': '3295047304',
        '甘肃省天水市中级人民法院': '3165393934',
        '天水市麦积区人民法院': '3165214673',
        '天水市秦州区人民法院': '3170405487',
        '甘谷县人民法院': '3171917538',
        '清水县人民法院': '3165433134',
        '秦安县人民法院': '3169977272',
        '甘肃省武威市中级人民法院': '3172017259',
        '武威市凉州区人民法院': '3191253638',
        '古浪县人民法院': '3171335519',
        '甘肃省张掖市中级人民法院': '3172084325',
        '张掖市甘州区人民法院': '2923560305',
        '高台县人民法院': '3172390040'

    }
    XINJIANGCOURT = {
        '新疆生产建设兵团伊宁垦区人民法院': '2980861344',
        '新疆维吾尔自治区阿克苏地区中级人民法院': '2811043839',
        '新和县人民法院': '2012422176',
        '福海县人民法院': '3332408775',
        '玛纳斯县人民法院': '3357642015',
        '乌恰县人民法院': '3390347520',
        '克拉玛依市克拉玛依区人民法院': '3384000706',
        '克拉玛依市独山子区人民法院': '3400594148',
        '新疆生产建设兵团叶尔盖提垦区人民法院': '3398182194',
        '乌鲁木齐铁路运输中级法院': '3306947598',
        '新疆维吾尔自治区乌鲁木齐市中级人民法院': '2619528867',
        '新疆维吾尔自治区高级人民法院': '3258605763',
        '新疆生产建设兵团第六师中级人民法院': '3458234407',
        '新疆维吾尔自治区高级人民法院伊犁哈萨克自治州分院': '3321503813',
        '伊宁县人民法院': '3321641362',
        '新疆生产建设兵团昭苏垦区人民法院': '3023068878'
    }
    AUCTIONKIND = {
        '房产': '50025969',
        '机动车': '50025972',
        '其他': '50025976',
        '资产': '50025971',
        '土地': '50025970',
        '股权': '125088031',
        '林权': '50025973',
        '无形资产': '122406001',
        '船舶': '125228021',
        '矿权': '50025974',
        '工程': '50025975'
    }
    # JIANGSUCOURT = {
    #     '江苏省南京市中级人民法院': '1934457578',
    #     '南京市鼓楼区人民法院': '1957658819',
    #     '南京市秦淮区人民法院': '2604738081',
    #     '南京市江宁区人民法院': '1957668705',
    #     '南京市栖霞区人民法院': '3216554287',
    #     '南京市浦口区人民法院': '2771731418',
    #     '南京市玄武区人民法院': '3201901953',
    #     '南京市六合区人民法院': '3191706476',
    #     '南京市高淳区人民法院': '3204190086',
    #     '南京市溧水区人民法院': '3201239112',
    #     '南京市建邺区人民法院': '3228526231',
    #     '南京市雨花台区人民法院': '3199842137',
    #     '南京铁路运输法院': '3179384524'
    #
    # }
    proxies = ["115.46.117.189:8123","61.135.217.7:80","118.114.77.47:8080","114.67.149.209:808","171.37.171.111:8123","110.73.1.24:8123","60.169.78.218:808","110.73.41.201:8123","119.62.105.44:8118","125.37.107.23:8118","222.141.15.122:8118","27.159.124.78:8118","175.31.188.253:8118","220.166.243.12:8118","171.39.42.137:8123","111.155.116.219:8123","121.31.103.169:8123","110.73.9.147:8123","114.230.99.36:46773","115.219.130.196:80","183.189.213.50:80","110.73.5.63:8123","117.78.37.198:8000","182.88.14.59:8123","180.167.46.22:53281","59.41.202.239:53281","124.72.216.83:808","153.34.199.194:80","27.40.139.239:61234","171.39.42.206:8123","221.10.159.234:1337","110.172.220.194:8080","121.12.42.223:61234","183.133.50.38:80","42.243.138.84:4336","39.81.158.112:8118","171.212.140.219:8118","14.111.8.46:8118","180.126.168.43:8118","42.55.170.182:80","60.24.165.120:8118","111.155.116.195:8123","123.185.129.186:8080","110.73.1.9:8123","110.216.60.162:80","59.40.69.108:8010","110.73.31.1:8123","113.195.163.212:48888","110.73.1.102:8123","101.22.113.198:8118","114.101.208.180:4326","171.39.42.227:8123","121.31.84.162:8123","110.73.41.188:8123","123.169.34.240:4366","114.234.162.180:4364","115.200.70.75:80","115.203.199.106:28897","116.52.196.69:8118","114.98.8.113:4326","58.243.204.50:4358","120.27.131.204:3128","110.73.5.196:8123","110.73.4.254:8123","171.83.227.239:808","110.72.44.198:8123","115.46.70.143:8123","115.46.71.57:8123","115.210.176.74:47849","60.187.241.79:808","115.46.85.200:8123","121.31.192.120:8123","182.90.105.26:8123","171.39.31.93:8123","182.90.51.202:8123","115.46.85.142:8123","222.185.53.190:8118","115.221.127.117:33280","27.37.177.44:9999","119.5.107.213:9999","114.216.219.114:8118","113.128.28.242:45438","110.73.32.169:8123","110.73.15.21:8123","117.93.23.208:8118","110.73.43.70:8123","118.254.149.61:3128","180.110.151.31:8118","218.6.160.93:63000","59.40.50.10:8010","39.71.148.34:8118","110.73.3.129:8123","110.73.14.114:8123","106.58.123.43:80","121.31.174.175:8123","220.161.39.43:8118","218.108.215.162:80","59.40.68.111:8010","42.59.216.137:80","171.122.217.159:9999","110.73.15.167:8123","110.73.0.116:8123","121.12.42.207:61234","119.144.124.108:8118","110.73.2.5:8123","106.58.152.8:80","180.118.242.92:808","114.232.93.137:25963","59.63.178.203:53281","113.195.163.231:48888","121.31.102.192:8123","59.40.51.73:8010","27.8.158.12:808","124.72.216.78:808","121.31.103.101:8123","121.31.138.228:8123","110.73.49.52:8123","139.210.49.68:8118","183.151.43.145:3128","60.168.80.135:808","59.32.37.32:3128","114.226.38.171:808","121.12.42.142:61234","121.31.143.171:8123","110.73.33.48:9999","171.38.26.16:8123","61.178.238.122:63000","175.154.131.8:9999","121.31.100.219:8123","117.92.153.213:21896","223.241.78.40:8010","112.233.59.149:9999","112.233.14.244:9999","123.8.228.186:9999","120.82.239.228:9999","27.209.248.155:9999","221.215.68.216:9999","180.121.133.41:8118","183.184.144.157:80","110.73.35.59:8123","111.155.116.215:8123","115.200.28.220:80","180.122.147.17:48557","182.88.129.40:8123","180.122.150.164:39472","115.203.194.185:43444","125.47.150.220:9999","113.123.50.79:808","115.61.77.120:9999","110.73.40.204:8123","111.155.116.217:8123","110.73.7.178:8123","122.245.156.212:808","110.73.52.67:8123","115.46.86.251:8123","123.145.128.139:8118","111.155.116.211:8123","59.40.51.190:8010","123.169.4.84:36711","182.90.83.85:8123","60.218.153.177:80","27.159.126.93:8118","110.73.51.92:8123","111.155.116.220:8123","122.4.28.117:40684","101.26.122.114:8118","111.155.116.196:8123","110.72.35.18:8123","118.187.58.34:53281","117.65.38.28:52335","114.216.93.175:8118","101.224.70.98:30149","115.203.210.129:43513","59.40.51.228:8010","171.38.26.83:8123","110.73.40.224:8123","218.81.232.107:31480","115.213.244.163:27141","112.94.190.231:9999","171.38.85.216:8123","183.186.23.128:9999","110.72.31.80:8123","175.163.66.22:80","125.45.131.40:8118","218.73.140.236:48603","222.210.170.55:8118","180.122.147.185:21642","59.40.51.85:8010","119.5.107.218:9999","113.85.170.0:9999","175.11.214.111:808","110.73.55.231:8123","124.161.146.142:9999","180.121.160.85:27913","59.40.68.210:8010","60.221.48.47:80","111.155.116.232:8123","112.114.86.164:9999","59.40.51.52:8010","27.11.241.78:8118","125.112.207.153:29459","49.76.10.215:808","59.40.68.97:8010","140.250.123.1:808","121.31.103.230:8123","123.185.128.210:8080","27.197.117.229:808","112.81.143.245:8118","222.141.10.176:8118","110.73.55.14:8123","120.39.117.253:34587","183.128.66.107:45438","110.73.53.139:8123","110.73.51.124:8123","171.39.0.149:8123","110.73.12.133:8123","110.73.35.25:8123","119.109.101.120:80","110.73.9.169:8123","182.90.21.137:8118","110.73.32.116:8123","175.165.51.145:9999","27.184.125.229:8118","110.73.5.170:8123","113.242.144.171:808","60.184.201.171:44849","115.46.69.146:8123","115.46.88.164:8123","110.72.16.194:8123","58.23.207.155:9999","222.242.171.5:63000","116.19.97.102:8118","59.40.51.37:8010","110.73.43.110:8123","182.90.71.45:8123","1.26.50.103:9999","115.203.199.121:32164","113.121.240.48:808","110.73.12.21:8123","171.124.56.253:9999","60.168.2.182:8118","27.154.181.26:47936","114.232.171.150:31278","110.73.28.39:8123","110.73.48.184:8123","222.54.76.235:80","119.5.0.23:808","171.36.154.21:8123","125.126.165.130:40933","110.73.6.149:8123","119.176.86.214:9999","171.121.25.99:9999","182.43.231.27:9999","182.245.93.94:8118","121.31.100.120:8123","58.209.47.32:42557","60.175.213.40:44435","117.69.99.116:37377","110.73.34.143:8123","115.46.71.206:8123","182.90.100.145:8123","115.46.96.48:8123","113.64.92.22:8080","183.184.148.221:80","223.241.117.86:8010","115.46.221.184:8123","110.73.35.233:8123","106.9.168.45:808","110.73.42.127:8123","110.73.9.109:8123","110.73.42.110:8123","121.31.101.159:8123","60.167.22.156:20548","121.31.100.38:8123","27.159.127.3:8118","121.31.101.212:8123","115.215.48.240:45933","123.163.19.30:30702","140.224.76.139:808","110.73.11.100:8123","110.73.3.246:8123","222.134.168.60:808","61.135.155.82:443","123.146.100.158:53005","223.241.116.214:8010","223.241.79.171:8010","182.90.123.89:8123","110.73.5.19:8123","110.87.0.247:25847","60.22.179.8:80","42.84.244.71:80","42.57.107.211:80","182.127.206.141:9999","120.39.118.130:31783","42.49.119.146:8118","222.221.161.161:9999","110.73.42.98:8123","59.40.50.184:8010","110.73.41.175:8123","111.137.6.95:80","110.73.8.233:8123","110.73.1.156:8123","110.73.40.2:8123","106.46.200.177:49962","171.39.40.121:8123","121.232.16.232:8118","110.73.14.39:8123","27.42.157.223:8080","121.205.254.134:47254","180.120.214.181:8888","49.87.180.155:40807","221.206.251.143:9999","110.73.1.245:8123","171.39.40.176:8123","182.90.56.98:80","59.40.51.225:8010","121.31.100.110:8123","180.120.208.104:8888","27.159.126.33:8118","110.73.48.152:8123","110.73.53.188:8123","110.73.10.241:8123","171.38.37.174:8123","115.221.120.38:808","27.206.232.130:8118","123.163.19.181:39967","171.39.40.112:8123","218.15.25.153:808","111.155.116.207:8123","101.65.205.40:808","125.122.142.242:80","110.73.51.39:8123","112.117.73.81:9999","223.241.119.131:8010","113.110.102.46:9999","114.217.117.96:23675","60.208.44.228:80","111.155.116.210:8123","171.39.28.205:8123","121.31.197.201:8123","112.95.27.62:9999","59.40.50.97:8010","59.40.68.160:8010","171.38.26.25:8123","115.61.109.221:8118","171.37.16.46:8123","110.73.8.58:8123","110.73.7.71:8123","123.185.131.48:8080","123.155.21.12:80","110.73.0.11:8123","59.40.69.187:8010","113.116.235.48:8118","49.66.201.177:8118","59.40.50.255:8010","112.252.255.86:8118","121.31.103.124:8123","120.40.135.252:27709","223.241.79.7:8010","121.12.42.233:61234","36.26.113.2:8118","222.76.147.29:29668","59.32.37.170:808","110.73.35.77:8123","182.88.123.254:8118","59.40.51.8:8010","110.73.54.112:8123","111.155.116.236:8123","111.155.116.205:8123","121.31.177.211:8123","110.73.4.217:8123","123.161.152.196:43293","120.39.119.112:23521","115.217.254.49:36480","171.38.90.53:8123","115.46.250.0:8123","110.73.29.24:8123","121.12.42.234:61234","110.73.206.237:8123","110.73.7.21:8123","111.155.120.226:8123","111.155.116.225:8123","110.73.35.64:8123","125.126.172.91:22388","223.241.117.173:8010","111.155.116.239:8123","110.185.42.43:8118","180.111.9.1:8118","113.123.3.19:808","221.4.133.67:53281","171.37.86.228:8123","111.155.120.229:8123","180.125.20.131:808","114.239.249.244:808","111.155.120.141:8123","171.108.205.85:53281","111.155.120.202:8123","111.155.120.173:8123","110.72.26.172:8123","121.30.57.244:80","121.30.57.244:80","110.73.3.198:8123","111.155.116.206:8123","113.232.2.252:80","110.73.11.39:8123","180.111.5.192:808","119.5.0.37:808","117.24.21.7:46115","183.184.145.173:80","218.81.71.3:37314","110.73.172.158:8123","183.130.63.251:80","114.231.29.29:41269","183.133.50.17:80","111.155.120.220:8123","123.163.21.70:42393","111.155.120.223:8123","121.31.193.230:8123","59.40.51.46:8010","110.73.34.181:8123","112.229.100.1:8118","182.90.71.215:8123","119.109.101.108:8118","183.189.164.200:80","115.46.87.39:8123","27.22.61.26:3128","59.40.51.193:8010","110.73.49.176:8123","171.38.39.169:8123","59.40.69.81:8010","183.185.150.113:80","182.88.90.64:8123","110.73.10.48:8123","59.40.51.4:8010","110.73.54.120:8123","112.113.209.182:4336","110.73.6.193:8123","110.73.9.146:8123","121.31.176.10:8123","121.31.192.196:8123","110.72.21.188:8123","110.200.241.253:80","111.155.120.170:8123","113.121.227.71:808","182.90.6.94:8118","110.73.3.53:8123","121.31.103.227:8123","116.208.13.253:3128","60.172.118.105:8888","123.161.238.241:49260","110.73.11.249:8123","121.31.172.123:8123","110.87.248.101:808","123.55.147.239:808","110.73.53.29:8123","125.122.117.155:808","110.73.10.251:8123","113.122.51.179:808","123.55.189.161:808","183.128.66.125:35826","121.12.42.250:61234","115.239.42.3:8118","110.72.16.64:8123","110.73.1.19:8123","119.167.51.101:8118","114.230.217.251:808","110.73.41.100:8123","110.73.2.187:8123","110.73.40.24:8123","182.90.101.77:8123","110.73.52.155:8123","110.73.41.21:8123","119.55.120.145:9999","180.173.82.97:8118","110.73.43.71:8123","171.127.174.82:9999","171.37.193.84:8123","110.73.12.179:8123","110.73.50.84:8123","171.38.37.226:8123","171.38.84.177:8123","121.31.198.135:8123","110.73.8.32:8123","171.37.171.145:8123","110.73.50.128:8123","121.31.103.95:8123","121.31.141.112:8123","121.31.71.36:8123","171.37.160.185:8123","115.46.78.25:8123","121.31.87.246:8123","121.31.177.106:8123","110.73.2.83:8123","171.38.42.20:8123","171.38.34.211:8123","110.73.29.180:8123","121.31.100.53:8123","110.73.41.76:8123","110.165.59.189:808","117.68.167.215:8118","110.73.8.108:8123","110.73.55.189:8123","27.19.78.70:808","119.108.156.5:8080","27.22.7.222:3128","121.12.42.7:61234","121.207.33.164:808","123.162.197.189:37802","110.73.54.122:8123","180.124.5.56:808","222.85.5.244:808","121.31.101.118:8123","27.40.140.174:808","49.85.6.67:20675","110.73.42.68:8123","171.39.238.198:8123","113.121.245.46:48475","60.167.135.145:40986","117.63.27.208:808","110.73.11.54:8123","115.200.21.206:80","49.85.4.65:48748","59.40.69.158:8010","112.86.197.163:808","183.166.197.61:808","59.40.68.142:8010","218.18.232.29:8080","106.46.95.132:47615","121.31.102.141:8123","115.200.2.20:80","110.72.45.8:8123","171.39.31.36:8123","121.31.147.33:8123","180.122.151.143:48803","113.87.89.129:53281","112.229.239.77:8118","171.39.236.84:8123","180.118.243.181:61234","101.27.189.92:8118","113.234.169.19:8118","115.46.68.36:8123","180.118.243.229:61234","121.31.100.148:8123","121.31.198.242:8123","117.60.208.12:38258","171.38.74.212:8123","182.88.253.149:8123","180.118.241.249:808","110.72.21.74:8123","117.25.189.125:43944","180.118.243.228:808","121.31.86.20:80","180.113.81.132:43756","117.71.156.96:28333","218.5.161.211:42859","223.215.142.118:4326","222.240.233.154:80","1.197.153.133:25831","183.133.51.165:80","218.5.161.211:42859","183.19.250.220:808","110.73.42.24:8123","59.40.69.58:8010","110.73.43.201:8123","171.39.42.62:8123","27.159.124.191:8118","110.87.5.148:25882","60.179.42.212:20688","180.172.221.37:29242","122.4.29.132:30900","110.73.15.115:8123","171.36.225.236:80","123.55.177.140:48523","59.58.240.95:31576","117.64.225.194:808","123.169.37.189:44644","110.73.2.143:8123","59.40.50.213:8010","60.187.15.232:80","110.73.41.219:8123","140.250.169.240:29557","113.93.103.92:42580","110.87.5.27:23015","110.72.29.50:8123","115.58.84.48:4331","116.28.171.38:808","122.4.40.56:31558","113.121.173.185:43527","220.162.165.164:45145","110.73.10.225:8123","111.155.116.208:8123","110.72.45.148:8123","115.203.192.233:41908","115.203.194.20:28560","180.155.142.38:42732","122.4.28.209:45192","114.230.121.171:39767","183.128.71.112:44827","220.178.197.101:41595","121.12.42.71:61234","121.12.42.89:61234","171.38.65.173:8123","222.85.5.126:49080","115.203.194.58:34527","115.203.213.21:808","115.203.193.151:29074","121.12.13.83:61234","115.222.1.168:80","110.73.52.71:8123","110.73.33.235:8123","114.99.85.78:45808","125.112.173.244:26370","110.72.254.183:8123","180.121.133.239:8888","110.73.11.111:8123","110.73.6.48:8123","180.122.148.103:20551","121.205.254.129:28588","114.226.164.89:29077","125.126.173.120:41580","171.38.98.161:8123","110.73.15.172:8123","106.58.120.137:80","180.106.34.147:8118","110.73.5.120:8123","115.217.252.201:48863","125.112.207.164:38380","110.73.30.135:8123","221.205.207.242:80","60.186.155.61:46267","115.215.51.29:30987","180.115.3.151:41838","49.83.118.88:8118","121.31.103.41:8123","111.155.116.224:8123","183.15.34.24:8010","121.228.10.96:25306","180.122.146.217:48336","210.26.59.192:8080","118.254.153.227:3128","121.31.101.241:8123","117.69.98.36:49884","183.150.239.18:3128","110.73.43.205:8123","58.244.196.29:808","110.73.28.140:8123","123.163.20.109:39493","42.235.254.13:8118","110.73.11.248:8123","110.73.48.106:8123","115.200.8.96:80","110.73.8.120:8123","113.226.207.134:80","59.62.233.230:8118","110.73.9.235:8123","59.40.50.2:8010","182.246.214.29:9999","121.31.143.184:8123","182.246.206.245:9999","121.31.101.0:8123","111.155.116.249:8123","115.200.35.2:80","110.73.12.206:8123","183.151.145.69:8118","111.155.116.229:8123","101.81.218.33:53281","223.241.78.213:8010","175.155.232.111:9999","110.73.8.142:8123","171.38.41.45:8123","110.72.39.251:8123","59.40.68.215:8010","121.31.87.238:8123","121.31.102.118:8123","121.12.42.219:61234","59.40.50.57:8010","27.46.30.61:9999","59.40.50.43:8010","110.73.28.27:8123","183.163.46.145:52335","110.73.28.216:8123","110.73.7.146:8123","110.216.64.135:80","59.40.51.242:8010","182.90.80.49:8123","59.40.50.160:8010","139.196.168.172:8888","111.155.116.240:8123","182.88.134.101:8123","125.41.109.177:8118","111.155.120.186:8123","106.43.52.239:9999","59.40.51.218:8010","171.38.26.87:8123","59.40.68.222:8010","111.155.120.188:8123","59.40.51.212:8010","116.196.90.236:808","118.122.110.62:8118","115.200.1.75:80","114.235.83.2:8118","115.200.170.183:80","115.239.53.206:8118","114.99.7.122:808","110.73.48.55:8123","121.31.100.152:8123","110.73.6.95:8123","110.73.14.93:8123","14.118.84.107:9999","121.31.86.143:8123","59.40.50.115:8010","183.151.40.252:3128","59.40.51.18:8010","171.39.0.191:8123","110.73.7.213:8123","110.73.30.15:8123","121.12.42.49:61234","121.31.156.92:8123","110.73.2.197:8123","123.56.137.89:808","112.255.225.238:8118","110.73.13.70:8123","121.31.173.246:8123","121.31.73.238:8123","111.155.116.201:8123","110.73.53.11:8123","110.73.4.53:8123","110.73.49.57:8123","111.155.116.228:8123","111.155.120.208:8123","110.73.15.228:8123","110.73.33.103:8123","111.222.0.221:80","110.73.48.168:8123","110.73.14.118:8123","182.90.109.27:8123","112.114.118.115:9999","110.73.8.162:8123","182.88.179.42:8123","180.124.6.74:808","59.40.69.5:8010","112.193.131.24:8118","121.31.145.213:8123","110.73.15.158:8123","110.72.45.137:8123","115.220.229.65:8118","180.173.141.242:52335","59.40.50.21:8010","110.73.43.188:8123","171.37.193.48:8123","110.73.9.28:8123","110.73.32.239:8123","180.175.120.249:62225","110.72.32.31:8123","114.95.186.244:62225","118.77.242.30:9999","110.73.34.248:8123","110.73.51.176:8123","110.73.9.34:8123","124.89.33.59:53281","121.31.102.51:8123","182.90.79.181:8123","110.72.16.2:8123","121.31.71.133:8123","60.189.123.156:8118","110.73.3.195:8123","110.73.42.125:8123","123.52.84.161:8118","110.73.55.145:8123","121.31.168.150:8123","182.90.101.177:8123","112.114.113.101:9999","110.73.12.146:8123","120.27.101.68:808","27.40.146.17:61234","183.63.101.62:53281","183.133.73.105:8118","180.121.129.70:8118","110.73.11.122:8123","121.31.169.129:8123","27.159.126.178:8118","110.73.3.95:8123","144.0.81.120:808","139.210.49.229:8118","101.68.73.54:53281","183.144.197.195:808","27.19.87.134:808","42.58.221.23:9999","119.41.202.158:53281","110.73.41.199:8123","49.64.222.236:8118","59.40.50.90:8010","114.115.216.99:80","121.31.103.192:8123","113.121.244.64:808","171.39.39.197:8123","42.49.119.145:8118","110.73.43.238:8123","110.73.5.97:8123","122.237.106.16:80","115.200.6.82:80","115.200.11.6:80","59.40.51.253:8010","110.73.11.8:8123","110.72.22.38:8123","220.163.241.148:8118","110.73.15.93:8123","59.40.50.94:8010","121.31.101.18:8123","110.73.7.200:8123","223.241.116.251:8010","182.112.132.128:8118","113.250.61.163:9999","121.12.42.91:61234","110.73.31.155:8123","113.242.141.27:808","121.31.101.99:8123","27.197.85.218:9999","121.31.101.134:8123","49.83.63.18:8118","117.64.225.229:808","115.148.169.191:9999","223.241.79.6:8010","59.40.69.64:8010","113.138.189.134:9999","110.73.11.224:8123","27.188.147.202:8118","59.40.51.130:8010","110.73.35.30:8123","121.12.42.60:61234","123.128.121.6:8118","110.73.9.112:8123","110.73.30.33:8123","180.118.240.141:61234","110.73.49.234:8123","117.13.199.113:8118","110.73.11.239:8123","182.88.89.81:8123","175.166.174.133:80","113.69.149.109:808","113.67.164.59:8118","171.124.219.7:9999","116.249.222.237:8118","121.31.193.99:8123","60.24.168.182:8118","110.73.54.210:8123","222.93.255.235:8118","110.73.30.204:8123","115.46.97.81:8123","114.230.30.195:808","180.118.243.23:61234","115.200.46.74:80","59.40.51.156:8010","110.73.50.72:8123","59.40.50.253:8010","113.123.44.98:808","114.226.166.217:35656","171.37.161.138:8123","27.219.24.71:9999","171.37.160.63:8123","180.122.149.21:48447","60.184.185.179:23521","113.237.48.172:9999","182.107.98.194:8118","221.205.180.178:80","116.115.169.160:9999","110.85.89.138:48140","180.155.138.16:35808","113.128.30.186:23318","222.76.147.202:32057","114.230.233.127:22424","121.12.42.32:61234","115.63.110.113:9999","115.202.161.57:808","111.155.120.137:8123","59.40.68.175:8010","111.183.80.179:8118","110.73.41.254:8123","182.88.187.44:8123","112.81.71.205:8118","114.230.41.206:808","115.200.25.38:80","124.161.116.66:9999","1.59.17.213:9999","222.163.155.175:9999","111.155.120.217:8123","110.73.48.194:8123","182.32.169.11:32886","121.31.103.110:8123","121.205.72.159:49591","106.46.88.41:36223","121.12.42.247:61234","49.76.234.225:8118","139.226.109.150:8118","119.119.27.5:8080","39.64.0.88:8118","180.118.121.58:41885","113.121.240.40:40179","59.40.50.63:8010","125.109.197.230:24405","125.78.104.116:20470","121.207.76.211:25913","125.122.137.164:80","110.73.4.112:8123","110.73.1.212:8123","115.203.221.152:34601","218.14.141.53:26007","171.36.62.40:8123","111.155.120.147:8123","59.40.68.170:8010","140.250.120.46:9999","27.40.132.250:808","110.73.7.224:8123","117.69.97.214:43783","122.242.94.9:48770","59.58.243.34:40297","222.89.86.175:24657","27.159.125.193:8118","49.88.158.218:22680","49.88.158.218:22680","125.126.171.111:44507","110.73.11.45:8123","112.229.239.211:8118","110.73.11.208:8123","171.39.45.216:8123","115.217.252.6:24061","110.73.14.159:8123","1.199.193.36:37156","124.165.175.161:9999","182.34.19.214:44452","171.39.28.104:8123","171.38.41.247:8123","110.73.1.73:8123","171.38.25.26:8123","180.118.241.54:61234","222.81.137.35:9999","110.73.40.16:8123","60.162.19.188:20612","115.203.198.35:23371","119.183.154.208:8118","182.88.167.131:8123","171.36.60.69:8123","182.246.2.214:9999","180.118.241.240:808","49.85.0.40:30239","180.118.243.49:808","110.72.39.151:8123","27.11.241.247:8118","113.4.216.109:8118","101.64.140.53:8118","180.155.143.114:45806","115.203.207.124:32449","111.155.120.165:8123","110.85.132.65:8118","222.141.12.188:8118","113.91.65.133:8118","163.125.73.235:9999","1.197.59.154:43024","120.32.139.174:45687","49.87.147.176:38281","60.175.198.155:22274","122.241.30.205:34841","180.122.149.1:42863","119.178.141.248:8118","123.163.131.84:20806","114.238.216.134:45348","60.214.190.248:9999","110.73.53.77:8123","115.203.193.71:26273","123.163.21.183:48300","222.191.169.159:25509","117.93.8.129:20830","180.122.145.93:37091","118.254.142.42:53281","114.232.116.190:8888","180.212.72.95:8118","180.115.14.140:22315","60.209.179.212:8118","115.203.210.69:42982","125.126.172.237:37102","115.203.200.122:40878","115.203.200.139:33015","110.72.23.123:8123","115.203.209.91:23214","222.161.123.3:9999","222.71.90.95:26265","49.77.185.97:44494","121.226.186.243:27468","120.42.120.230:48507","110.73.29.253:8123","59.40.68.201:8010","223.241.119.85:8010","111.155.120.139:8123","111.155.116.212:8123","114.225.251.174:8118","27.197.83.210:9999","110.73.15.69:8123","110.73.33.115:8123","110.73.0.78:8123","110.73.9.58:8123"]
    def getPage(self,url):
        proxie = {"http": self.proxies[random.randint(0, 999)]}
        proxy_support = urllib2.ProxyHandler(proxie)
        # opener = urllib2.build_opener(proxy_support,urllib2.HTTPHandler(debuglevel=1))
        opener = urllib2.build_opener(proxy_support)
        urllib2.install_opener(opener)
        user_agent = '"Mozilla/5.0 (Windows NT 6.2; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/38.0.2125.122 Safari/537.36"'
        headers = {'User-Agent': user_agent}
        maxTryNum = 10
        html = ''
        for tries in range(maxTryNum):
            try:
                req = urllib2.Request(url, headers=headers)
                html = urllib2.urlopen(req).read()
                break
            except:
                if tries < (maxTryNum - 1):
                    continue
                else:
                    print "Has tried %d times to access url %s, all failed!", maxTryNum, url
                    break
        return html
    def getContents(self,url):
        page = self.getPage(url)
        pattern = re.compile(
            r'<script id="sf-item-list-data" type="text/json">\n{"data":(.*?)}</script>',
            re.S)
        item = re.findall(pattern, page)
        str = item[0]
        #return json.loads(str)
        return str
    def getPageNum(self,url):
        page = self.getPage(url)
        pattern = re.compile(
            r'<em class="page-total">(.*?)</em>',
            re.S)
        item = re.findall(pattern, page)
        if item.__len__() != 0:
            pageNum = item[0]
        else:
            pageNum = 1
        # return json.loads(str)
        return pageNum
    #解析数据
    def getColumn(self, url):
        # 网页json数据
        str = self.getContents(url)
        auctionPython = json.loads(str.decode("gbk"))
        return auctionPython
    def getDateBeijing(self):
        for court in self.BEIJINGCOURT.keys():
            print court + "开始爬取"
            for kind in self.AUCTIONKIND.keys():
                urlForPageNum = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + self.BEIJINGCOURT[court] + '&category=' + self.AUCTIONKIND[kind]+ '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1'
                for i in range(1, int(self.getPageNum(urlForPageNum)) + 1):
                    url = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + self.BEIJINGCOURT[court] + '&category=' + self.AUCTIONKIND[kind]+ '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1&page=' + str(i)
                    for auctionPython in self.getColumn(url):
                        mysql.insertData('auction_cache_beijing','auction_info_beijing', auctionPython, kind,self.BEIJINGCOURT[court],self.circle)
            print court +"抓取完成"
    def getDateTianjin(self):
        for court in self.TIANJINCOURT.keys():
            print court + "开始爬取"
            for kind in self.AUCTIONKIND.keys():
                urlForPageNum = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                                self.TIANJINCOURT[court] + '&category=' + self.AUCTIONKIND[
                                    kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1'
                for i in range(1, int(self.getPageNum(urlForPageNum)) + 1):
                    url = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                          self.TIANJINCOURT[court] + '&category=' + self.AUCTIONKIND[
                              kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1&page=' + str(
                        i)
                    for auctionPython in self.getColumn(url):
                        mysql.insertData('auction_cache_tianjin','auction_info_tianjin', auctionPython, kind, self.TIANJINCOURT[court],self.circle)
            print court + "抓取完成"
    def getDateChongqing(self):
        for court in self.CHONGQINGCOURT.keys():
            print court + "开始爬取"
            for kind in self.AUCTIONKIND.keys():
                urlForPageNum = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                                self.CHONGQINGCOURT[court] + '&category=' + self.AUCTIONKIND[
                                    kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1'
                for i in range(1, int(self.getPageNum(urlForPageNum)) + 1):
                    url = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                          self.CHONGQINGCOURT[court] + '&category=' + self.AUCTIONKIND[
                              kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1&page=' + str(
                        i)
                    for auctionPython in self.getColumn(url):
                        mysql.insertData('auction_cache_chongqing', 'auction_info_chongqing', auctionPython, kind,
                                         self.CHONGQINGCOURT[court],self.circle)
            print court + "抓取完成"
    def getDateShanghai(self):
        for court in self.SHANGHAICOURT.keys():
            print court + "开始爬取"
            for kind in self.AUCTIONKIND.keys():
                urlForPageNum = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                                self.SHANGHAICOURT[court] + '&category=' + self.AUCTIONKIND[
                                    kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1'
                for i in range(1, int(self.getPageNum(urlForPageNum)) + 1):
                    url = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                          self.SHANGHAICOURT[court] + '&category=' + self.AUCTIONKIND[
                              kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1&page=' + str(
                        i)
                    for auctionPython in self.getColumn(url):
                        mysql.insertData('auction_cache_shanghai', 'auction_info_shanghai', auctionPython, kind,
                                         self.SHANGHAICOURT[court],self.circle)
            print court + "抓取完成"
    def getDataShandong(self):
        for court in self.SHANDONGCOURT.keys():
            print court + "开始爬取"
            for kind in self.AUCTIONKIND.keys():
                urlForPageNum = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                                self.SHANDONGCOURT[court] + '&category=' + self.AUCTIONKIND[
                                    kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1'
                for i in range(1, int(self.getPageNum(urlForPageNum)) + 1):
                    url = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                          self.SHANDONGCOURT[court] + '&category=' + self.AUCTIONKIND[
                              kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1&page=' + str(
                        i)
                    for auctionPython in self.getColumn(url):
                        mysql.insertDataProvince('auction_cache_shandong', 'auction_info_shandong', auctionPython,
                                         kind,
                                         self.SHANDONGCOURT[court],self.circle)
            print court + "抓取完成"
    def getDataFujian(self):
        for court in self.FUJIANCOURT.keys():
            print court + "开始爬取"
            for kind in self.AUCTIONKIND.keys():
                urlForPageNum = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                                self.FUJIANCOURT[court] + '&category=' + self.AUCTIONKIND[
                                    kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1'
                for i in range(1, int(self.getPageNum(urlForPageNum)) + 1):
                    url = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                          self.FUJIANCOURT[court] + '&category=' + self.AUCTIONKIND[
                              kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1&page=' + str(
                        i)
                    for auctionPython in self.getColumn(url):
                        mysql.insertDataProvince('auction_cache_fujian', 'auction_info_fujian', auctionPython,
                                         kind,
                                         self.FUJIANCOURT[court],self.circle)
            print court + "抓取完成"
    def getDataAnhui(self):
        for court in self.ANHUICOURT.keys():
            print court + "开始爬取"
            for kind in self.AUCTIONKIND.keys():
                urlForPageNum = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                                self.ANHUICOURT[court] + '&category=' + self.AUCTIONKIND[
                                    kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1'
                for i in range(1, int(self.getPageNum(urlForPageNum)) + 1):
                    url = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                          self.ANHUICOURT[court] + '&category=' + self.AUCTIONKIND[
                              kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1&page=' + str(
                        i)
                    for auctionPython in self.getColumn(url):
                        mysql.insertDataProvince('auction_cache_anhui', 'auction_info_anhui', auctionPython,
                                         kind,
                                         self.ANHUICOURT[court],self.circle)
            print court + "抓取完成"
    def getDataNeimenggu(self):
        for court in self.NEIMENGGUCOURT.keys():
            print court + "开始爬取"
            for kind in self.AUCTIONKIND.keys():
                urlForPageNum = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                                self.NEIMENGGUCOURT[court] + '&category=' + self.AUCTIONKIND[
                                    kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1'
                for i in range(1, int(self.getPageNum(urlForPageNum)) + 1):
                    url = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                          self.NEIMENGGUCOURT[court] + '&category=' + self.AUCTIONKIND[
                              kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1&page=' + str(
                        i)
                    for auctionPython in self.getColumn(url):
                        mysql.insertDataProvince('auction_cache_neimenggu', 'auction_info_neimenggu', auctionPython,
                                         kind,
                                         self.NEIMENGGUCOURT[court],self.circle)
            print court + "抓取完成"
    def getDataHenan(self):
        for court in self.HENANCOURT.keys():
            print court + "开始爬取"
            for kind in self.AUCTIONKIND.keys():
                urlForPageNum = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                                self.HENANCOURT[court] + '&category=' + self.AUCTIONKIND[
                                    kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1'
                for i in range(1, int(self.getPageNum(urlForPageNum)) + 1):
                    url = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                          self.HENANCOURT[court] + '&category=' + self.AUCTIONKIND[
                              kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1&page=' + str(
                        i)
                    for auctionPython in self.getColumn(url):
                        mysql.insertDataProvince('auction_cache_henan', 'auction_info_henan', auctionPython,
                                         kind,
                                         self.HENANCOURT[court],self.circle)
            print court + "抓取完成"
    def getDataHebei(self):
        for court in self.HEBEICOURT.keys():
            print court + "开始爬取"
            for kind in self.AUCTIONKIND.keys():
                urlForPageNum = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                                self.HEBEICOURT[court] + '&category=' + self.AUCTIONKIND[
                                    kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1'
                for i in range(1, int(self.getPageNum(urlForPageNum)) + 1):
                    url = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                          self.HEBEICOURT[court] + '&category=' + self.AUCTIONKIND[
                              kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1&page=' + str(
                        i)
                    for auctionPython in self.getColumn(url):
                        mysql.insertDataProvince('auction_cache_hebei', 'auction_info_hebei', auctionPython,
                                         kind,
                                         self.HEBEICOURT[court],self.circle)
            print court + "抓取完成"
    def getDataJiangxi(self):
        for court in self.JIANGXICOURT.keys():
            print court + "开始爬取"
            for kind in self.AUCTIONKIND.keys():
                urlForPageNum = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                                self.JIANGXICOURT[court] + '&category=' + self.AUCTIONKIND[
                                    kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1'
                for i in range(1, int(self.getPageNum(urlForPageNum)) + 1):
                    url = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                          self.JIANGXICOURT[court] + '&category=' + self.AUCTIONKIND[
                              kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1&page=' + str(
                        i)
                    for auctionPython in self.getColumn(url):
                        mysql.insertDataProvince('auction_cache_jiangxi', 'auction_info_jiangxi', auctionPython,
                                         kind,
                                         self.JIANGXICOURT[court],self.circle)
            print court + "抓取完成"
    def getDataShangxi(self):
        for court in self.SHANGXICOURT.keys():
            print court + "开始爬取"
            for kind in self.AUCTIONKIND.keys():
                urlForPageNum = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                                self.SHANGXICOURT[court] + '&category=' + self.AUCTIONKIND[
                                    kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1'
                for i in range(1, int(self.getPageNum(urlForPageNum)) + 1):
                    url = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                          self.SHANGXICOURT[court] + '&category=' + self.AUCTIONKIND[
                              kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1&page=' + str(
                        i)
                    for auctionPython in self.getColumn(url):
                        mysql.insertDataProvince('auction_cache_shangxi', 'auction_info_shangxi', auctionPython,
                                         kind,
                                         self.SHANGXICOURT[court],self.circle)
            print court + "抓取完成"
    def getDataShangxi2(self):
        for court in self.SHANGXI2COURT.keys():
            print court + "开始爬取"
            for kind in self.AUCTIONKIND.keys():
                urlForPageNum = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                                self.SHANGXI2COURT[court] + '&category=' + self.AUCTIONKIND[
                                    kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1'
                for i in range(1, int(self.getPageNum(urlForPageNum)) + 1):
                    url = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                          self.SHANGXI2COURT[court] + '&category=' + self.AUCTIONKIND[
                              kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1&page=' + str(
                        i)
                    for auctionPython in self.getColumn(url):
                        mysql.insertDataProvince('auction_cache_shangxi2', 'auction_info_shangxi2', auctionPython,
                                         kind,
                                         self.SHANGXI2COURT[court],self.circle)
            print court + "抓取完成"
    def getDataHubei(self):
        for court in self.HUBEICOURT.keys():
            print court + "开始爬取"
            for kind in self.AUCTIONKIND.keys():
                urlForPageNum = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                                self.HUBEICOURT[court] + '&category=' + self.AUCTIONKIND[
                                    kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1'
                for i in range(1, int(self.getPageNum(urlForPageNum)) + 1):
                    url = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                          self.HUBEICOURT[court] + '&category=' + self.AUCTIONKIND[
                              kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1&page=' + str(
                        i)
                    for auctionPython in self.getColumn(url):
                        mysql.insertDataProvince('auction_cache_hubei', 'auction_info_hubei', auctionPython,
                                         kind,
                                         self.HUBEICOURT[court],self.circle)
            print court + "抓取完成"
    def getDataHunan(self):
        for court in self.HUNANCOURT.keys():
            print court + "开始爬取"
            for kind in self.AUCTIONKIND.keys():
                urlForPageNum = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                                self.HUNANCOURT[court] + '&category=' + self.AUCTIONKIND[
                                    kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1'
                for i in range(1, int(self.getPageNum(urlForPageNum)) + 1):
                    url = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                          self.HUNANCOURT[court] + '&category=' + self.AUCTIONKIND[
                              kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1&page=' + str(
                        i)
                    for auctionPython in self.getColumn(url):
                        mysql.insertDataProvince('auction_cache_hunan', 'auction_info_hunan', auctionPython,
                                         kind,
                                         self.HUNANCOURT[court],self.circle)
            print court + "抓取完成"
    def getDataGuangdong(self):
        for court in self.GUANGDONGCOURT.keys():
            print court + "开始爬取"
            for kind in self.AUCTIONKIND.keys():
                urlForPageNum = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                                self.GUANGDONGCOURT[court] + '&category=' + self.AUCTIONKIND[
                                    kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1'
                for i in range(1, int(self.getPageNum(urlForPageNum)) + 1):
                    url = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                          self.GUANGDONGCOURT[court] + '&category=' + self.AUCTIONKIND[
                              kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1&page=' + str(
                        i)
                    for auctionPython in self.getColumn(url):
                        mysql.insertDataProvince('auction_cache_guangdong', 'auction_info_guangdong', auctionPython,
                                         kind,
                                         self.GUANGDONGCOURT[court],self.circle)
            print court + "抓取完成"
    def getDataZhejiang(self):
        for court in self.ZHEJIANGCOURT.keys():
            print court + "开始爬取"
            for kind in self.AUCTIONKIND.keys():
                urlForPageNum = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                                self.ZHEJIANGCOURT[court] + '&category=' + self.AUCTIONKIND[
                                    kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1'
                for i in range(1, int(self.getPageNum(urlForPageNum)) + 1):
                    url = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                          self.ZHEJIANGCOURT[court] + '&category=' + self.AUCTIONKIND[
                              kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1&page=' + str(
                        i)
                    for auctionPython in self.getColumn(url):
                        mysql.insertDataProvince('auction_cache_zhejiang', 'auction_info_zhejiang', auctionPython,
                                         kind,
                                         self.ZHEJIANGCOURT[court],self.circle)
            print court + "抓取完成"
    def getDataJiangsu(self):
        for court in self.JIANGSUCOURT.keys():
            print court + "开始爬取"
            for kind in self.AUCTIONKIND.keys():
                urlForPageNum = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                                self.JIANGSUCOURT[court] + '&category=' + self.AUCTIONKIND[
                                    kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1'
                for i in range(1, int(self.getPageNum(urlForPageNum)) + 1):
                    url = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                          self.JIANGSUCOURT[court] + '&category=' + self.AUCTIONKIND[
                              kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1&page=' + str(
                        i)
                    for auctionPython in self.getColumn(url):
                        mysql.insertDataProvince('auction_cache_jiangsu', 'auction_info_jiangsu', auctionPython,
                                         kind,
                                         self.JIANGSUCOURT[court],self.circle)
            print court + "抓取完成"
    def getDataYunnan(self):
        for court in self.YUNNANCOURT.keys():
            print court + "开始爬取"
            for kind in self.AUCTIONKIND.keys():
                urlForPageNum = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                                self.YUNNANCOURT[court] + '&category=' + self.AUCTIONKIND[
                                    kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1'
                for i in range(1, int(self.getPageNum(urlForPageNum)) + 1):
                    url = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                          self.YUNNANCOURT[court] + '&category=' + self.AUCTIONKIND[
                              kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1&page=' + str(
                        i)
                    for auctionPython in self.getColumn(url):
                        mysql.insertDataProvince('auction_cache_yunnan', 'auction_info_yunnan', auctionPython,
                                         kind,
                                         self.YUNNANCOURT[court],self.circle)
            print court + "抓取完成"
    def getDataHainan(self):
        for court in self.HAINANCOURT.keys():
            print court + "开始爬取"
            for kind in self.AUCTIONKIND.keys():
                urlForPageNum = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                                self.HAINANCOURT[court] + '&category=' + self.AUCTIONKIND[
                                    kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1'
                for i in range(1, int(self.getPageNum(urlForPageNum)) + 1):
                    url = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                          self.HAINANCOURT[court] + '&category=' + self.AUCTIONKIND[
                              kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1&page=' + str(
                        i)
                    for auctionPython in self.getColumn(url):
                        mysql.insertDataProvince('auction_cache_hainan', 'auction_info_hainan', auctionPython,
                                         kind,
                                         self.HAINANCOURT[court],self.circle)
            print court + "抓取完成"
    def getDataGuangxi(self):
        for court in self.GUANGXICOURT.keys():
            print court + "开始爬取"
            for kind in self.AUCTIONKIND.keys():
                urlForPageNum = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                                self.GUANGXICOURT[court] + '&category=' + self.AUCTIONKIND[
                                    kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1'
                for i in range(1, int(self.getPageNum(urlForPageNum)) + 1):
                    url = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                          self.GUANGXICOURT[court] + '&category=' + self.AUCTIONKIND[
                              kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1&page=' + str(
                        i)
                    for auctionPython in self.getColumn(url):
                        mysql.insertDataProvince('auction_cache_guangxi', 'auction_info_guangxi', auctionPython,
                                         kind,
                                         self.GUANGXICOURT[court],self.circle)
            print court + "抓取完成"
    def getDataSichuan(self):
        for court in self.SICHUANCOURT.keys():
            print court + "开始爬取"
            for kind in self.AUCTIONKIND.keys():
                urlForPageNum = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                                self.SICHUANCOURT[court] + '&category=' + self.AUCTIONKIND[
                                    kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1'
                for i in range(1, int(self.getPageNum(urlForPageNum)) + 1):
                    url = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                          self.SICHUANCOURT[court] + '&category=' + self.AUCTIONKIND[
                              kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1&page=' + str(
                        i)
                    for auctionPython in self.getColumn(url):
                        mysql.insertDataProvince('auction_cache_sichuan', 'auction_info_sichuan', auctionPython,
                                         kind,
                                         self.SICHUANCOURT[court],self.circle)
            print court + "抓取完成"
    def getDataGuizhou(self):
        for court in self.GUIZHOUCOURT.keys():
            print court + "开始爬取"
            for kind in self.AUCTIONKIND.keys():
                urlForPageNum = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                                self.GUIZHOUCOURT[court] + '&category=' + self.AUCTIONKIND[
                                    kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1'
                for i in range(1, int(self.getPageNum(urlForPageNum)) + 1):
                    url = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                          self.GUIZHOUCOURT[court] + '&category=' + self.AUCTIONKIND[
                              kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1&page=' + str(
                        i)
                    for auctionPython in self.getColumn(url):
                        mysql.insertDataProvince('auction_cache_guizhou', 'auction_info_guizhou', auctionPython,
                                         kind,
                                         self.GUIZHOUCOURT[court],self.circle)
            print court + "抓取完成"
    def getDataNingxia(self):
        for court in self.NINGXIACOURT.keys():
            print court + "开始爬取"
            for kind in self.AUCTIONKIND.keys():
                urlForPageNum = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                                self.NINGXIACOURT[court] + '&category=' + self.AUCTIONKIND[
                                    kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1'
                for i in range(1, int(self.getPageNum(urlForPageNum)) + 1):
                    url = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                          self.NINGXIACOURT[court] + '&category=' + self.AUCTIONKIND[
                              kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1&page=' + str(
                        i)
                    for auctionPython in self.getColumn(url):
                        mysql.insertDataProvince('auction_cache_ningxia', 'auction_info_ningxia', auctionPython,
                                         kind,
                                         self.NINGXIACOURT[court],self.circle)
            print court + "抓取完成"
    def getDataQinghai(self):
        for court in self.QINGHAICOURT.keys():
            print court + "开始爬取"
            for kind in self.AUCTIONKIND.keys():
                urlForPageNum = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                                self.QINGHAICOURT[court] + '&category=' + self.AUCTIONKIND[
                                    kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1'
                for i in range(1, int(self.getPageNum(urlForPageNum)) + 1):
                    url = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                          self.QINGHAICOURT[court] + '&category=' + self.AUCTIONKIND[
                              kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1&page=' + str(
                        i)
                    for auctionPython in self.getColumn(url):
                        mysql.insertDataProvince('auction_cache_qinghai', 'auction_info_qinghai', auctionPython,
                                         kind,
                                         self.QINGHAICOURT[court],self.circle)
            print court + "抓取完成"
    def getDataLiaoning(self):
        for court in self.LIAONINGCOURT.keys():
            print court + "开始爬取"
            for kind in self.AUCTIONKIND.keys():
                urlForPageNum = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                                self.LIAONINGCOURT[court] + '&category=' + self.AUCTIONKIND[
                                    kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1'
                for i in range(1, int(self.getPageNum(urlForPageNum)) + 1):
                    url = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                          self.LIAONINGCOURT[court] + '&category=' + self.AUCTIONKIND[
                              kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1&page=' + str(
                        i)
                    for auctionPython in self.getColumn(url):
                        mysql.insertDataProvince('auction_cache_liaoning', 'auction_info_liaoning', auctionPython,
                                         kind,
                                         self.LIAONINGCOURT[court],self.circle)
            print court + "抓取完成"
    def getDataJilin(self):
        for court in self.JILINCOURT.keys():
            print court + "开始爬取"
            for kind in self.AUCTIONKIND.keys():
                urlForPageNum = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                                self.JILINCOURT[court] + '&category=' + self.AUCTIONKIND[
                                    kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1'
                for i in range(1, int(self.getPageNum(urlForPageNum)) + 1):
                    url = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                          self.JILINCOURT[court] + '&category=' + self.AUCTIONKIND[
                              kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1&page=' + str(
                        i)
                    for auctionPython in self.getColumn(url):
                        mysql.insertDataProvince('auction_cache_jilin', 'auction_info_jilin', auctionPython,
                                         kind,
                                         self.JILINCOURT[court],self.circle)
            print court + "抓取完成"
    def getDataHeilongjiang(self):
        for court in self.HEILONGJIANGCOURT.keys():
            print court + "开始爬取"
            for kind in self.AUCTIONKIND.keys():
                urlForPageNum = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                                self.HEILONGJIANGCOURT[court] + '&category=' + self.AUCTIONKIND[
                                    kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1'
                for i in range(1, int(self.getPageNum(urlForPageNum)) + 1):
                    url = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                          self.HEILONGJIANGCOURT[court] + '&category=' + self.AUCTIONKIND[
                              kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1&page=' + str(
                        i)
                    for auctionPython in self.getColumn(url):
                        mysql.insertDataProvince('auction_cache_heilongjiang', 'auction_info_heilongjiang', auctionPython,
                                         kind,
                                         self.HEILONGJIANGCOURT[court],self.circle)
            print court + "抓取完成"
    def getDataXizang(self):
        for court in self.XIZANGCOURT.keys():
            print court + "开始爬取"
            for kind in self.AUCTIONKIND.keys():
                urlForPageNum = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                                self.XIZANGCOURT[court] + '&category=' + self.AUCTIONKIND[
                                    kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1'
                for i in range(1, int(self.getPageNum(urlForPageNum)) + 1):
                    url = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                          self.XIZANGCOURT[court] + '&category=' + self.AUCTIONKIND[
                              kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1&page=' + str(
                        i)
                    for auctionPython in self.getColumn(url):
                        mysql.insertDataProvince('auction_cache_xizang', 'auction_info_xizang', auctionPython,
                                         kind,
                                         self.XIZANGCOURT[court],self.circle)
            print court + "抓取完成"
    def getDataGansu(self):
        for court in self.GANSUCOURT.keys():
            print court + "开始爬取"
            for kind in self.AUCTIONKIND.keys():
                urlForPageNum = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                                self.GANSUCOURT[court] + '&category=' + self.AUCTIONKIND[
                                    kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1'
                for i in range(1, int(self.getPageNum(urlForPageNum)) + 1):
                    url = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                          self.GANSUCOURT[court] + '&category=' + self.AUCTIONKIND[
                              kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1&page=' + str(
                        i)
                    for auctionPython in self.getColumn(url):
                        mysql.insertDataProvince('auction_cache_gansu', 'auction_info_gansu', auctionPython,
                                         kind,
                                         self.GANSUCOURT[court],self.circle)
            print court + "抓取完成"
    def getDataXinjiang(self):
        for court in self.XINJIANGCOURT.keys():
            print court + "开始爬取"
            for kind in self.AUCTIONKIND.keys():
                urlForPageNum = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                                self.XINJIANGCOURT[court] + '&category=' + self.AUCTIONKIND[
                                    kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1'
                for i in range(1, int(self.getPageNum(urlForPageNum)) + 1):
                    url = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&circ='+ self.circle +'&user_id=' + \
                          self.XINJIANGCOURT[court] + '&category=' + self.AUCTIONKIND[
                              kind] + '&auction_start_from='+self.time_from +'&auction_start_to='+self.time_to+'&auction_start_seg=-1&page=' + str(
                        i)
                    for auctionPython in self.getColumn(url):
                        mysql.insertDataProvince('auction_cache_xinjiang', 'auction_info_xinjiang', auctionPython,
                                         kind,
                                         self.XINJIANGCOURT[court],self.circle)
            print court + "抓取完成"


    def getCityData(self,courtDict,kindDict,table_name,table_cache_name):
        for court in courtDict.keys():
            print court + "开始爬取"
            for kind in kindDict.keys():
                urlForPageNum = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&user_id=' + \
                                courtDict[court] + '&category=' + kindDict[
                                    kind] + '&auction_start_from=2016-01-01&auction_start_to=2017-10-26&auction_start_seg=-1'
                for i in range(1, int(self.getPageNum(urlForPageNum)) + 1):
                    url = 'https://sf.taobao.com/item_list.htm?spm=a213w.7398504.miniNav.16.JX0D6R&user_id=' + \
                          courtDict[court] + '&category=' + kindDict[
                              kind] + '&auction_start_from=2016-01-01&auction_start_to=2017-10-26&auction_start_seg=-1&page=' + str(
                        i)
                    for auctionPython in self.getColumn(url):
                        mysql.insertData(table_cache_name, table_name, auctionPython,
                                                 kind,
                                                 courtDict[court])
            print court + "抓取完成"
    def getAllData(self):
        for circle in self.circleList:
            self.circle = circle
            self.getDateChongqing()
            self.getDateBeijing()
            self.getDateShanghai()
            self.getDateTianjin()
            self.getDataShandong()
            self.getDataFujian()
            self.getDataAnhui()
            self.getDataNeimenggu()
            self.getDataHenan()
            self.getDataHebei()
            self.getDataJiangxi()
            self.getDataShangxi()
            self.getDataShangxi2()
            self.getDataHubei()
            self.getDataHunan()
            self.getDataGuangdong()
            self.getDataZhejiang()
            self.getDataJiangsu()
            self.getDataYunnan()
            self.getDataHainan()
            self.getDataGuangxi()
            self.getDataSichuan()
            self.getDataGuizhou()
            self.getDataNingxia()
            self.getDataQinghai()
            self.getDataLiaoning()
            self.getDataJilin()
            self.getDataHeilongjiang()
            self.getDataXizang()
            self.getDataGansu()
            self.getDataXinjiang()

    def timerFun(self,sched_Timer):
        flag = 0
        while True:
            now = datetime.datetime.now()
            if now == sched_Timer:
                self.getAllData()
                flag = 1
            else:
                if flag == 1:
                    sched_Timer = sched_Timer+datetime.timedelta(days=1)
                    flag=0


auctionCrawler = AuctionCrawler()
mysql = Mysql()
auctionCrawler.getAllData()

#if __name__ == '__main__':
    #sched_Timer = datetime.datetime(2017,11,10,16,50)
    #print 'run the time task at {0}'.format(sched_Timer)
    #auctionCrawler.timerFun(sched_Timer)
